<!DOCTYPE html>



  


<html class="theme-next gemini use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="职业规划," />





  <link rel="alternate" href="/atom.xml" title="一匹来自北方的狼" type="application/atom+xml" />






<meta name="description" content="最近在做2015年规划，思考运维到底应该干哪些事，得出如下图表一张，欢迎各位同仁一起讨论。&amp;emsp;   运维蓝图">
<meta name="keywords" content="职业规划">
<meta property="og:type" content="article">
<meta property="og:title" content="运维蓝图思考">
<meta property="og:url" content="https://wolf-7.github.io/职业规划/2015/01/02/运维蓝图思考.html">
<meta property="og:site_name" content="一匹来自北方的狼">
<meta property="og:description" content="最近在做2015年规划，思考运维到底应该干哪些事，得出如下图表一张，欢迎各位同仁一起讨论。&amp;emsp;   运维蓝图">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://wolf-7.github.io/images/operation-1.jpg">
<meta property="og:updated_time" content="2019-01-14T11:59:08.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="运维蓝图思考">
<meta name="twitter:description" content="最近在做2015年规划，思考运维到底应该干哪些事，得出如下图表一张，欢迎各位同仁一起讨论。&amp;emsp;   运维蓝图">
<meta name="twitter:image" content="https://wolf-7.github.io/images/operation-1.jpg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Gemini',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="https://wolf-7.github.io/职业规划/2015/01/02/运维蓝图思考.html"/>





  <title>运维蓝图思考 | 一匹来自北方的狼</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">一匹来自北方的狼</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle"></p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://wolf-7.github.io/职业规划/2015/01/02/运维蓝图思考.html">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="一匹来自北方的狼">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="一匹来自北方的狼">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">运维蓝图思考</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2015-01-02T21:09:25+08:00">
                2015-01-02
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/职业规划/" itemprop="url" rel="index">
                    <span itemprop="name">职业规划</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <hr>
<p><font color="black" size="3"> &#x6700;&#x8FD1;&#x5728;&#x505A;2015&#x5E74;&#x89C4;&#x5212;&#xFF0C;&#x601D;&#x8003;&#x8FD0;&#x7EF4;&#x5230;&#x5E95;&#x5E94;&#x8BE5;&#x5E72;&#x54EA;&#x4E9B;&#x4E8B;&#xFF0C;&#x5F97;&#x51FA;&#x5982;&#x4E0B;&#x56FE;&#x8868;&#x4E00;&#x5F20;&#xFF0C;&#x6B22;&#x8FCE;&#x5404;&#x4F4D;&#x540C;&#x4EC1;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x3002;</font>&#x2003;</p>
<p><font color="red" size="4"> <strong> &#x8FD0;&#x7EF4;&#x84DD;&#x56FE; </strong> </font><br><img src="/images/operation-1.jpg" width="100%" height="80%"></p>
<hr>
<a id="more"></a>
<h4 id="&#x5B9A;&#x6807;&#x51C6;"><a href="#&#x5B9A;&#x6807;&#x51C6;" class="headerlink" title="&#x5B9A;&#x6807;&#x51C6;"></a>&#x5B9A;&#x6807;&#x51C6;</h4><p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7EBF;&#x4E0A;&#x73AF;&#x5883;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#x3001;&#x5E72;&#x51C0;&#x7684;&#x3001;&#x89C4;&#x8303;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x8981;&#x5B9A;&#x6807;&#x51C6;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li><p>&#x673A;&#x578B;&#xFF1A;&#x7EBF;&#x4E0A;&#x673A;&#x578B;&#x5C3D;&#x91CF;&#x5C11;&#xFF0C;&#x7701;&#x5F97;&#x5149;&#x5404;&#x79CD;&#x673A;&#x578B;&#x7684;&#x5907;&#x673A;&#x5C31;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x6D6A;&#x8D39;&#x6210;&#x672C;&#xFF0C;&#x9488;&#x5BF9;&#x5C11;&#x91CF;&#x673A;&#x578B;&#x505A;&#x7CBE;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x505A;</p>
</li>
<li><p>OS&#xFF1A;&#x6BD4;&#x5982;&#x7EDF;&#x4E00;CentOS6.8&#xFF0C;&#x7EDF;&#x4E00;kernel&#xFF0C;&#x7EDF;&#x4E00;&#x5404;&#x79CD;&#x4F18;&#x5316;&#x914D;&#x7F6E;&#xFF0C;&#x66F4;&#x5B89;&#x5168;&#xFF0C;&#x66F4;&#x7A33;&#x5B9A;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#xFF1A;&#x6BD4;&#x5982;MySQL&#x3001;Tomcat&#x3001;Nginx&#xFF0C;&#x5C3D;&#x91CF;&#x7EDF;&#x4E00;&#x7248;&#x672C;&#xFF0C;&#x7EDF;&#x4E00;&#x6269;&#x5C55;&#xFF0C;&#x7EDF;&#x4E00;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#xFF0C;&#x7EDF;&#x4E00;&#x76D1;&#x63A7;&#x65B9;&#x5F0F;</p>
</li>
<li><p>&#x53D1;&#x5E03;&#x6807;&#x51C6;&#xFF1A;&#x6BD4;&#x5982;&#x542F;&#x505C;&#x811A;&#x672C;&#xFF0C;&#x542F;&#x52A8;&#x8D26;&#x53F7;&#xFF0C;LOG&#x683C;&#x5F0F;&#x3001;&#x5207;&#x5206;&#x65B9;&#x5F0F;&#xFF0C;&#x90E8;&#x7F72;&#x8DEF;&#x5F84;&#xFF0C;watchdog</p>
</li>
<li><p>&#x76D1;&#x63A7;&#x6807;&#x51C6;&#xFF1A;&#x5236;&#x5B9A;&#x6307;&#x6807;&#x9EC4;&#x9875;&#xFF0C;&#x673A;&#x5668;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x4E1A;&#x52A1;&#x7A0B;&#x5E8F;&#x3001;&#x4E2D;&#x95F4;&#x4EF6;&#x7B49;&#x7B49;&#x90FD;&#x8981;&#x5982;&#x4F55;&#x76D1;&#x63A7;&#xFF0C;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x5410;&#x51FA;&#x53CD;&#x5E94;&#x81EA;&#x8EAB;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x7684;&#x6307;&#x6807;&#x5747;&#x8981;&#x5B9A;&#x89C4;&#x8303;</p>
</li>
</ul>
<h4 id="&#x8D44;&#x6E90;&#x7BA1;&#x7406;"><a href="#&#x8D44;&#x6E90;&#x7BA1;&#x7406;" class="headerlink" title="&#x8D44;&#x6E90;&#x7BA1;&#x7406;"></a>&#x8D44;&#x6E90;&#x7BA1;&#x7406;</h4><p>&#x8FD0;&#x7EF4;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x652F;&#x6491;&#x6027;&#x7684;&#x90E8;&#x95E8;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#x8D5A;&#x94B1;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x7701;&#x94B1;&#xFF0C;&#x628A;&#x8D44;&#x6E90;&#x5C3D;&#x91CF;&#x5408;&#x7406;&#x5229;&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x82B1;&#x66F4;&#x5C11;&#x7684;&#x94B1;&#x529E;&#x66F4;&#x591A;&#x7684;&#x4E8B;</p>
<ul>
<li><p>&#x505A;&#x597D;&#x9884;&#x7B97;&#xFF0C;&#x5BB9;&#x91CF;&#x89C4;&#x5212;&#xFF0C;&#x770B;&#x4E1A;&#x52A1;&#x589E;&#x91CF;&#x5F97;&#x51FA;&#x9884;&#x7B97;&#x673A;&#x5668;&#x91CF;</p>
</li>
<li><p>&#x5404;&#x79CD;&#x673A;&#x578B;&#x9700;&#x8981;&#x5907;&#x673A;&#x914D;&#x6BD4;&#xFF0C;&#x907F;&#x514D;&#x67D0;&#x673A;&#x5668;&#x574F;&#x4E86;&#x4E4B;&#x540E;&#x627E;&#x4E0D;&#x5230;&#x5907;&#x673A;&#x53EF;&#x6362;</p>
</li>
<li><p>&#x673A;&#x5668;&#x751F;&#x547D;&#x5468;&#x671F;&#x7BA1;&#x7406;&#xFF0C;&#x6D41;&#x8F6C;&#x6D41;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x7EBF;&#xFF0C;&#x4E0B;&#x7EBF;&#xFF0C;&#x6545;&#x969C;&#xFF0C;&#x501F;&#x7528;&#x7B49;&#x7B49;</p>
</li>
<li><p>&#x901A;&#x8FC7;&#x7C7B;&#x4F3C;&#x670D;&#x52A1;&#x6811;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5206;&#x95E8;&#x522B;&#x7C7B;&#x7684;&#x7BA1;&#x7406;&#x673A;&#x5668;&#xFF0C;&#x77E5;&#x9053;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x7528;&#x9014;</p>
</li>
<li><p>&#x901A;&#x8FC7;&#x7C7B;&#x4F3C;Borg&#x8FD9;&#x6837;&#x7684;&#x7EDF;&#x4E00;&#x8C03;&#x5EA6;&#x7CFB;&#x7EDF;&#xFF0C;&#x6DF7;&#x90E8;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x5347;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;</p>
</li>
</ul>
<h4 id="&#x76D1;&#x63A7;"><a href="#&#x76D1;&#x63A7;" class="headerlink" title="&#x76D1;&#x63A7;"></a>&#x76D1;&#x63A7;</h4><p>&#x76D1;&#x63A7;&#x4F5C;&#x4E3A;&#x8FD0;&#x7EF4;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x7684;&#x5FC5;&#x8981;&#x4FDD;&#x969C;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x597D;&#xFF0C;&#x505A;&#x5168;&#x9762;&#xFF0C;&#x505A;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x6709;&#x670D;&#x52A1;&#x90FD;&#x6302;&#x4E86;&#xFF0C;&#x76D1;&#x63A7;&#x4E0D;&#x80FD;&#x6302;</p>
<ul>
<li><p>&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x81EA;&#x8EAB;&#x6784;&#x5EFA;&#xFF0C;&#x76D1;&#x63A7;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x662F;&#x8FD0;&#x7EF4;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x96BE;&#x5EA6;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x7684;&#x6BD4;&#x5982;Borgmon&#x3001;Gorilla&#x3001;OpenTSDB&#x3001;Zabbix+Grafana&#x3001;Ganglia&#x7B49;</p>
</li>
<li><p>&#x673A;&#x5668;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x3001;&#x57FA;&#x7840;&#x73AF;&#x5883;&#x76D1;&#x63A7;&#x3001;&#x65E5;&#x5FD7;&#x76D1;&#x63A7;&#x3001;&#x7F51;&#x7EDC;&#x76D1;&#x63A7;&#x3001;&#x8BBF;&#x95EE;&#x8D28;&#x91CF;&#x76D1;&#x63A7;&#x3001;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;&#xFF0C;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#xFF0C;&#x6CA1;&#x6709;&#x6700;&#x5168;&#xFF0C;&#x53EA;&#x6709;&#x66F4;&#x5168;</p>
</li>
<li><p>&#x90E8;&#x5206;&#x95EE;&#x9898;&#x62A5;&#x8B66;&#x4E4B;&#x540E;&#xFF0C;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x662F;&#x91CD;&#x590D;&#x7684;&#x56FA;&#x5316;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x6545;&#x969C;&#x81EA;&#x6108;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x81EA;&#x52A8;&#x5904;&#x7406;&#xFF0C;&#x5373;&#x4F7F;&#x65E0;&#x6CD5;&#x81EA;&#x52A8;&#x5904;&#x7406;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6293;&#x73B0;&#x573A;&#xFF0C;&#x63D0;&#x4F9B;&#x540E;&#x7EED;&#x5206;&#x6790;&#x4F9D;&#x636E;</p>
</li>
</ul>
<h4 id="&#x5B89;&#x5168;"><a href="#&#x5B89;&#x5168;" class="headerlink" title="&#x5B89;&#x5168;"></a>&#x5B89;&#x5168;</h4><p>&#x6240;&#x8C13;&#x5B89;&#x5168;&#x65E0;&#x5C0F;&#x4E8B;&#xFF0C;&#x5B89;&#x5168;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#x5230;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x5B58;&#x4EA1;&#xFF0C;&#x6709;&#x7684;&#x516C;&#x53F8;&#x4F1A;&#x628A;&#x5B89;&#x5168;&#x56E2;&#x961F;&#x653E;&#x5230;&#x8FD0;&#x7EF4;&#x90E8;&#x95E8;&#x4E0B;&#x9762;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x5355;&#x62CE;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x7BA1;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x600E;&#x4E48;&#x5212;&#x5206;&#xFF0C;&#x5B89;&#x5168;&#x90FD;&#x662F;&#x8FD0;&#x7EF4;&#x4E00;&#x5B9A;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7684;</p>
<ul>
<li><p>&#x767B;&#x5F55;&#x63A7;&#x5236;&#x548C;&#x64CD;&#x4F5C;&#x5BA1;&#x8BA1;&#xFF0C;&#x6BD4;&#x5982;&#x5404;&#x4E2A;&#x516C;&#x53F8;&#x505A;&#x7684;&#x5821;&#x5792;&#x673A;&#x3001;&#x8DF3;&#x677F;&#x673A;&#xFF0C;&#x63A7;&#x5236;&#x54EA;&#x4E9B;&#x4EBA;&#x53EF;&#x4EE5;&#x767B;&#x5F55;&#x54EA;&#x4E9B;&#x673A;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x5747;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x5747;&#x53EF;&#x5BA1;&#x8BA1;</p>
</li>
<li><p>&#x5B89;&#x5168;&#x63A5;&#x5165;&#xFF0C;&#x6BD4;&#x5982;&#x9632;DDOS&#xFF0C;&#x6D41;&#x91CF;&#x6E05;&#x6D17;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x6240;&#x6709;&#x670D;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x653E;&#x7F6E;&#x4E00;&#x9053;&#x8BA9;&#x4EBA;&#x4FE1;&#x8D56;&#x7684;&#x957F;&#x57CE;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x5B89;&#x5168;&#xFF0C;&#x6BD4;&#x5982;&#x7814;&#x53D1;&#x540C;&#x5B66;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x7F16;&#x7801;&#x4E0A;&#x7684;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x518D;&#x7ECF;&#x5E38;&#x505A;&#x4E00;&#x4E0B;&#x6F0F;&#x6D1E;&#x626B;&#x63CF;&#xFF0C;&#x626B;&#x626B;&#x66F4;&#x5065;&#x5EB7;</p>
</li>
</ul>
<h4 id="&#x707E;&#x96BE;&#x7BA1;&#x7406;"><a href="#&#x707E;&#x96BE;&#x7BA1;&#x7406;" class="headerlink" title="&#x707E;&#x96BE;&#x7BA1;&#x7406;"></a>&#x707E;&#x96BE;&#x7BA1;&#x7406;</h4><p>&#x7EBF;&#x4E0A;&#x670D;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#x662F;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x7684;&#x7B2C;&#x4E00;&#x8981;&#x52A1;&#xFF0C;&#x707E;&#x96BE;&#x7BA1;&#x7406;&#xFF0C;&#x662F;&#x5176;&#x4E2D;&#x91CD;&#x8981;&#x4E00;&#x73AF;</p>
<ul>
<li><p>&#x9996;&#x5148;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x672C;&#x8EAB;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E4B;&#x524D;&#x5C31;&#x8981;&#x8003;&#x8651;&#x597D;&#x600E;&#x4E48;&#x505A;&#x5BB9;&#x707E;&#xFF0C;&#x6709;&#x5355;&#x70B9;&#x7684;&#x7CFB;&#x7EDF;&#x663E;&#x7136;&#x662F;&#x8FC7;&#x4E0D;&#x4E86;&#x51C6;&#x5165;&#x7684;&#xFF0C;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x4E0D;&#x80FD;&#x63A5;</p>
</li>
<li><p>&#x91CD;&#x8981;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x505A;&#x597D;&#x5907;&#x4EFD;&#xFF0C;&#x53EA;&#x5907;&#x4EFD;&#x6CA1;&#x6F14;&#x7EC3;&#x53EF;&#x80FD;&#x4F1A;&#x6B65;&#x4E86;gitlab&#x7684;&#x540E;&#x5C18;&#xFF0C;&#x6240;&#x4EE5;&#x5B9A;&#x671F;&#x6F14;&#x7EC3;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#xFF0C;&#x53E6;&#x5916;&#x63D0;&#x524D;&#x627E;&#x597D;&#x64C5;&#x957F;&#x6570;&#x636E;&#x6062;&#x590D;&#x7684;&#x4F19;&#x4F34;&#xFF0C;&#x7701;&#x5F97;&#x4E34;&#x65F6;&#x62B1;&#x4F5B;&#x811A;</p>
</li>
<li><p>&#x7EBF;&#x4E0A;&#x6240;&#x6709;&#x53D8;&#x66F4;&#x64CD;&#x4F5C;&#xFF0C;&#x6545;&#x969C;&#x5904;&#x7406;&#xFF0C;&#x9700;&#x6C42;&#x5904;&#x7406;&#x90FD;&#x8981;&#x6709;&#x5B8C;&#x5584;&#x7684;SOP&#xFF0C;&#x65B0;&#x4EBA;&#x6765;&#x4E86;&#xFF0C;&#x770B;&#x7740;SOP&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;</p>
</li>
<li><p>&#x5B95;&#x673A;&#x6F14;&#x7EC3;&#xFF0C;&#x5B9A;&#x671F;&#x5DE1;&#x68C0;&#x8981;&#x5E38;&#x505A;&#xFF0C;&#x9884;&#x6599;&#x5916;&#x7684;&#x6545;&#x969C;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x4E0D;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;</p>
</li>
</ul>
<h4 id="&#x8BBF;&#x95EE;&#x8D28;&#x91CF;"><a href="#&#x8BBF;&#x95EE;&#x8D28;&#x91CF;" class="headerlink" title="&#x8BBF;&#x95EE;&#x8D28;&#x91CF;"></a>&#x8BBF;&#x95EE;&#x8D28;&#x91CF;</h4><p>&#x516C;&#x53F8;&#x505A;&#x7684;&#x4E1A;&#x52A1;&#x5982;&#x679C;&#x662F;To C&#x7684;&#xFF0C;&#x8FD9;&#x5757;&#x5C31;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5BA2;&#x6237;&#x90FD;&#x6CA1;&#x591A;&#x5C11;&#x8010;&#x5FC3;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x5BA2;&#x6237;&#x611F;&#x89C9;&#x7F51;&#x7AD9;&#x54CD;&#x5E94;&#x6162;&#xFF0C;&#x8FD9;&#x4F1A;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x6D41;&#x5931;</p>
<ul>
<li><p>&#x8BBF;&#x95EE;&#x8D28;&#x91CF;&#x8981;&#x505A;&#x5168;&#x56FD;&#x751A;&#x81F3;&#x5168;&#x7403;&#x76D1;&#x63A7;&#xFF0C;&#x5404;&#x4E2A;&#x7701;&#x5E02;&#xFF0C;&#x5404;&#x4E2A;&#x4E3B;&#x8981;&#x94FE;&#x8DEF;&#xFF0C;&#x641E;&#x4E2A;&#x5927;&#x5C4F;&#xFF0C;&#x5168;&#x56FD;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x8D28;&#x91CF;&#x6E05;&#x6670;&#x53EF;&#x89C1;</p>
</li>
<li><p>&#x901A;&#x8FC7;CDN&#xFF0C;&#x56FE;&#x7247;&#x4F18;&#x5316;&#xFF0C;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#xFF0C;&#x6D41;&#x91CF;&#x8C03;&#x5EA6;&#x7B49;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x8BA9;&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x53D8;&#x6210;&#x4E0E;&#x53CB;&#x5546;&#x7ADE;&#x4E89;&#x7684;&#x4E00;&#x5927;&#x4F18;&#x52BF;</p>
</li>
</ul>
<h4 id="&#x53D8;&#x66F4;&#x7BA1;&#x7406;"><a href="#&#x53D8;&#x66F4;&#x7BA1;&#x7406;" class="headerlink" title="&#x53D8;&#x66F4;&#x7BA1;&#x7406;"></a>&#x53D8;&#x66F4;&#x7BA1;&#x7406;</h4><p>&#x5BF9;&#x7EBF;&#x4E0A;&#x505A;&#x53D8;&#x66F4;&#xFF0C;&#x662F;&#x5BFC;&#x81F4;&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x5927;&#x6E90;&#x5934;&#xFF0C;&#x8FD9;&#x5757;&#x8981;&#x5355;&#x72EC;&#x62CE;&#x51FA;&#x6765;&#x8BF4;&#x8BF4;</p>
<ul>
<li><p>&#x7CFB;&#x7EDF;&#x7EC4;&#x4EA4;&#x4ED8;&#x673A;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x4E1A;&#x52A1;&#x7279;&#x70B9;&#x505A;&#x4E00;&#x6B21;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x505A;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#xFF0C;&#x5B89;&#x88C5;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x673A;&#x5668;&#x6302;&#x8F7D;&#x5230;&#x670D;&#x52A1;&#x6811;&#x81EA;&#x52A8;&#x89E6;&#x53D1;&#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;</p>
</li>
<li><p>&#x5927;&#x70B9;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x6BCF;&#x5929;&#x51E0;&#x5343;&#x6B21;&#x53D1;&#x5E03;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x6709;&#x4E2A;&#x90E8;&#x7F72;&#x5E73;&#x53F0;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x5386;&#x53F2;&#x7248;&#x672C;&#x8981;&#x53EF;&#x56DE;&#x6EAF;&#xFF0C;&#x4E00;&#x952E;&#x56DE;&#x6EDA;&#xFF0C;&#x652F;&#x6301;&#x5404;&#x79CD;&#x7B56;&#x7565;&#x5404;&#x79CD;&#x5E76;&#x53D1;&#x5EA6;&#x4E0A;&#x7EBF;&#xFF0C;&#x5177;&#x5907;&#x5206;&#x53D1;&#x5927;&#x6587;&#x4EF6;&#x5230;&#x51E0;&#x4E07;&#x751A;&#x81F3;&#x51E0;&#x5341;&#x4E07;&#x53F0;&#x673A;&#x5668;&#x7684;&#x80FD;&#x529B;</p>
</li>
<li><p>&#x5173;&#x8054;&#x5173;&#x7CFB;&#x7C7B;&#x578B;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x540D;&#x5B57;&#x670D;&#x52A1;&#x89E3;&#x51B3;&#xFF0C;&#x5F00;&#x5173;&#x7C7B;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E2D;&#x5FC3;&#x5316;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x6216;&#x8005;&#x91C7;&#x7528;&#x4E00;&#x6B21;&#x53D1;&#x5E03;&#x89E3;&#x51B3;&#xFF0C;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5982;&#x679C;&#x90FD;&#x652F;&#x6301;reload&#x914D;&#x7F6E;&#x5012;&#x662F;&#x4E0D;&#x9519;</p>
</li>
</ul>
<h4 id="&#x7F16;&#x7A0B;&#x6846;&#x67B6;"><a href="#&#x7F16;&#x7A0B;&#x6846;&#x67B6;" class="headerlink" title="&#x7F16;&#x7A0B;&#x6846;&#x67B6;"></a>&#x7F16;&#x7A0B;&#x6846;&#x67B6;</h4><p>&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#x597D;&#x50CF;&#x8DDF;&#x8FD0;&#x7EF4;&#x65E0;&#x5173;&#xFF0C;&#x5B9E;&#x5219;&#x4E0D;&#x7136;&#x3002;&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#x4F1A;&#x8BA9;&#x8FD0;&#x7EF4;&#x590D;&#x6742;&#x5EA6;&#x964D;&#x4F4E;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x6846;&#x67B6;&#x4E2D;&#x5D4C;&#x5165;&#x8FD0;&#x7EF4;&#x903B;&#x8F91;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x8FD0;&#x7EF4;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x4E0D;&#x662F;&#x597D;&#x67B6;&#x6784;&#x5E08;</p>
<ul>
<li><p>&#x7EDF;&#x4E00;RPC&#x6846;&#x67B6;&#xFF0C;&#x7EDF;&#x4E00;&#x91CD;&#x8BD5;&#x7B56;&#x7565;&#xFF0C;&#x7EDF;&#x4E00;&#x540D;&#x5B57;&#x670D;&#x52A1;&#xFF0C;&#x7EDF;&#x4E00;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#xFF0C;&#x7EDF;&#x4E00;watchdog&#xFF0C;&#x7EDF;&#x4E00;&#x76D1;&#x63A7;&#x65B9;&#x5F0F;&#xFF0C;&#x7EDF;&#x4E00;&#x65E5;&#x5FD7;&#x6253;&#x5370;&#x2026;</p>
</li>
<li><p>&#x591A;&#x73AF;&#x5883;&#x652F;&#x6301;&#xFF1A;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5355;&#x6D4B;&#x73AF;&#x5883;&#xFF0C;&#x96C6;&#x6D4B;&#x73AF;&#x5883;&#xFF0C;&#x5C0F;&#x6D41;&#x91CF;&#x73AF;&#x5883;&#xFF0C;&#x7EBF;&#x4E0A;&#x73AF;&#x5883;&#x2026;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x53D1;&#x5E03;&#x5305;&#x4E0A;&#x7EBF;&#xFF0C;&#x641E;&#x5B9A;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x65B9;&#x9762;&#xFF0C;&#x6BD4;&#x5982;&#x63A5;&#x53E3;&#x6743;&#x9650;&#x63A7;&#x5236;&#xFF0C;&#x63A5;&#x53E3;&#x7248;&#x672C;&#x7BA1;&#x7406;&#xFF0C;&#x6D41;&#x63A7;&#xFF0C;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#xFF0C;&#x7B49;&#x7B49;</p>
</li>
</ul>
<h4 id="&#x81EA;&#x52A8;&#x5316;&#x5E73;&#x53F0;"><a href="#&#x81EA;&#x52A8;&#x5316;&#x5E73;&#x53F0;" class="headerlink" title="&#x81EA;&#x52A8;&#x5316;&#x5E73;&#x53F0;"></a>&#x81EA;&#x52A8;&#x5316;&#x5E73;&#x53F0;</h4><p>&#x8FD0;&#x7EF4;&#x8FD9;&#x4E2A;&#x884C;&#x5F53;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;console&#x4E00;&#x4E2A;pash&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x7684;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x76F8;&#x5173;&#x7CFB;&#x7EDF;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x63D0;&#x9AD8;&#x7A33;&#x5B9A;&#x6027;</p>
<ul>
<li><p>&#x53D1;&#x5E03;&#x4E4B;&#x524D;&#xFF1A;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;gitlab&#x3001;&#x7F16;&#x8BD1;&#x6253;&#x5305;&#x5E73;&#x53F0;&#x3001;&#x5236;&#x54C1;&#x7BA1;&#x7406;&#x4ED3;&#x5E93;</p>
</li>
<li><p>&#x53D1;&#x5E03;&#x4E2D;&#xFF1A;&#x673A;&#x5668;&#x7BA1;&#x7406;&#x5206;&#x7EC4;&#x7CFB;&#x7EDF;&#xFF0C;&#x90E8;&#x7F72;&#x7CFB;&#x7EDF;&#xFF0C;&#x5927;&#x6587;&#x4EF6;&#x5206;&#x53D1;&#x5DE5;&#x5177;</p>
</li>
<li><p>&#x53D1;&#x5E03;&#x4E4B;&#x540E;&#xFF1A;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#xFF0C;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x5E73;&#x53F0;</p>
</li>
<li><p>&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#xFF1A;&#x521D;&#x59CB;&#x5316;&#x5E73;&#x53F0;&#x6765;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8DF3;&#x677F;&#x673A;&#x3001;&#x5821;&#x5792;&#x673A;&#x63A7;&#x5236;&#x767B;&#x5F55;&#xFF0C;&#x5DE5;&#x5355;&#x7CFB;&#x7EDF;&#x7B49;&#x7B49;</p>
</li>
</ul>
<h4 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h4><p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6CE8;&#x91CD;&#x670D;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x6CE8;&#x91CD;&#x6210;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x90A3;&#x5C31;&#x5E94;&#x8BE5;&#x6CE8;&#x91CD;&#x8FD0;&#x7EF4;&#xFF0C;&#x8FD9;&#x7FA4;&#x9ED8;&#x9ED8;&#x5DE5;&#x4F5C;&#x5728;&#x670D;&#x52A1;&#x80CC;&#x540E;&#x7684;&#x80CC;&#x9505;&#x4FA0;&#xFF0C;&#x8BF7;&#x73CD;&#x60DC;&#xFF01;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/职业规划/" rel="tag"># 职业规划</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/Git/2016/02/02/一台电脑绑定多个github帐号教程.html" rel="prev" title="一台电脑绑定多个GitHub帐号教程">
                一台电脑绑定多个GitHub帐号教程 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpg"
                alt="一匹来自北方的狼" />
            
              <p class="site-author-name" itemprop="name">一匹来自北方的狼</p>
              <p class="site-description motion-element" itemprop="description">雪藏风凌骨，<br/>空隐道玄心。<br/>寒窗问诸佛，<br/>飞渡红尘烬。</p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">14</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            
              
              
              <div class="site-state-item site-state-categories">
                <a href="/categories/index.html">
                  <span class="site-state-item-count">6</span>
                  <span class="site-state-item-name">分类</span>
                </a>
              </div>
            

            
              
              
              <div class="site-state-item site-state-tags">
                <a href="/tags/index.html">
                  <span class="site-state-item-count">5</span>
                  <span class="site-state-item-name">标签</span>
                </a>
              </div>
            

          </nav>

          
            <div class="feed-link motion-element">
              <a href="/atom.xml" rel="alternate">
                <i class="fa fa-rss"></i>
                RSS
              </a>
            </div>
          

          
            <div class="links-of-author motion-element">
                
                  <span class="links-of-author-item">
                    <a href="https://github.com/wolf-7" target="_blank" title="GitHub">
                      
                        <i class="fa fa-fw fa-github"></i></a>
                  </span>
                
            </div>
          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-4"><a class="nav-link" href="#定标准"><span class="nav-number">1.</span> <span class="nav-text">定标准</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#资源管理"><span class="nav-number">2.</span> <span class="nav-text">资源管理</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#监控"><span class="nav-number">3.</span> <span class="nav-text">监控</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#安全"><span class="nav-number">4.</span> <span class="nav-text">安全</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#灾难管理"><span class="nav-number">5.</span> <span class="nav-text">灾难管理</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#访问质量"><span class="nav-number">6.</span> <span class="nav-text">访问质量</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#变更管理"><span class="nav-number">7.</span> <span class="nav-text">变更管理</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#编程框架"><span class="nav-number">8.</span> <span class="nav-text">编程框架</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#自动化平台"><span class="nav-number">9.</span> <span class="nav-text">自动化平台</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#结语"><span class="nav-number">10.</span> <span class="nav-text">结语</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2019</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">一匹来自北方的狼</span>

  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Gemini</a> v5.1.4</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.4"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.4"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  





  

  

  

  
  

  

  

  

</body>
</html>
