<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。">
    

    <!--Author-->
    
        <meta name="author" content="一匹来自北方的狼">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="做一个职业运维人"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="一匹来自北方的狼"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

    <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>做一个职业运维人 - 一匹来自北方的狼</title>

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0-alpha.2/css/bootstrap.min.css" integrity="sha384-y3tfxAZXuh4HwSYylfB+J125MxIs6mR5FOHamPBG064zB+AFeWH94NdvaCBm8qnd" crossorigin="anonymous">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Google Analytics -->
    


</head>


<body>

<div class="bg-gradient"></div>
<div class="bg-pattern"></div>

<!-- Menu -->
<!--Menu Links and Overlay-->
<div class="menu-bg">
    <div class="menu-container">
        <ul>
            
            <li class="menu-item">
                <a href="/">
                    Home
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/archives">
                    Archives
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/categories">
                    Categories
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/tags">
                    Tags
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/about">
                    About
                </a>
            </li>
            
        </ul>
    </div>
</div>

<!--Hamburger Icon-->
<nav>
    <a href="#menu"></a>
</nav>

<div class="container">

    <!-- Main Content -->
    <div class="row">
    <div class="col-sm-12">

        <!--Title and Logo-->
        <header>
    <div class="logo">
        <a href="/"><i class="logo-icon fa fa-cube" aria-hidden="true"></i></a>
        
    </div>
</header>

        <section class="main">
            
<div class="post">

    <div class="post-header">
        <h1 class="title">
            <a href="/职业规划/2018/01/01/做一个职业运维人.html">
                做一个职业运维人
            </a>
        </h1>
        <div class="post-info">
            
                <span class="date">2018-01-01</span>
            
            
            
                <span class="category">
                    <a href="/categories/职业规划/">职业规划</a>
                </span>
            
        </div>
    </div>

    <div class="content">

        <!-- Gallery -->
        

        <!-- Post Content -->
        <hr>
<font color="" size="3"> &#x5F88;&#x591A;&#x4E09;&#x56DB;&#x5E74;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x56E0;&#x4E3A;&#x7F3A;&#x5C11;&#x5FC5;&#x8981;&#x7684;&#x804C;&#x4E1A;&#x7D20;&#x517B;&#x7684;&#x57F9;&#x8BAD;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x65B9;&#x6CD5;&#x6216;&#x591A;&#x6216;&#x5C11;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5F71;&#x54CD;&#x4E86;&#x81EA;&#x8EAB;&#x7684;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x3002;&#x600E;&#x4E48;&#x505A;&#x624D;&#x7B97;&#x662F;&#x4F1A;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x51E0;&#x70B9;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x4F9B;&#x8BF8;&#x541B;&#x53C2;&#x8003;&#x3002; </font>

<hr>
<a id="more"></a>
<h4 id="&#x641E;&#x6E05;&#x695A;&#x516C;&#x53F8;&#x4E3A;&#x4EC0;&#x4E48;&#x8058;&#x8BF7;&#x4F60;"><a href="#&#x641E;&#x6E05;&#x695A;&#x516C;&#x53F8;&#x4E3A;&#x4EC0;&#x4E48;&#x8058;&#x8BF7;&#x4F60;" class="headerlink" title="&#x641E;&#x6E05;&#x695A;&#x516C;&#x53F8;&#x4E3A;&#x4EC0;&#x4E48;&#x8058;&#x8BF7;&#x4F60;"></a>&#x641E;&#x6E05;&#x695A;&#x516C;&#x53F8;&#x4E3A;&#x4EC0;&#x4E48;&#x8058;&#x8BF7;&#x4F60;</h4><p>&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x6148;&#x5584;&#x673A;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x4EE5;&#x8425;&#x5229;&#x4E3A;&#x76EE;&#x7684;&#xFF0C;&#x516C;&#x53F8;&#x8058;&#x8BF7;&#x4F60;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x5E2E;&#x52A9;&#x516C;&#x53F8;&#x53BB;&#x8425;&#x5229;&#xFF0C;&#x5E2E;&#x52A9;&#x516C;&#x53F8;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x516C;&#x53F8;&#x6CA1;&#x5565;&#x7528;&#x5904;&#xFF0C;&#x6709;&#x4F60;&#x6CA1;&#x4F60;&#x6CA1;&#x533A;&#x522B;&#xFF0C;&#x90A3;&#x5C31;&#x79BB;&#x89E3;&#x8058;&#x4E0D;&#x8FDC;&#x4E86;&#x3002;</p>
<h4 id="&#x4E0D;&#x65AD;&#x5347;&#x804C;&#x52A0;&#x85AA;&#x7684;&#x79D8;&#x8BC0;"><a href="#&#x4E0D;&#x65AD;&#x5347;&#x804C;&#x52A0;&#x85AA;&#x7684;&#x79D8;&#x8BC0;" class="headerlink" title="&#x4E0D;&#x65AD;&#x5347;&#x804C;&#x52A0;&#x85AA;&#x7684;&#x79D8;&#x8BC0;"></a>&#x4E0D;&#x65AD;&#x5347;&#x804C;&#x52A0;&#x85AA;&#x7684;&#x79D8;&#x8BC0;</h4><p>&#x8981;&#x4E0D;&#x65AD;&#x6709;&#x4EA7;&#x51FA;&#xFF0C;&#x53D8;&#x6210;&#x7A00;&#x7F3A;&#x4EBA;&#x624D;&#x3002;&#x8981;&#x60F3;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x5E2E;&#x516C;&#x53F8;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5E2E;&#x9886;&#x5BFC;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x5E76;&#x4E0D;&#x9057;&#x4F59;&#x529B;&#x7684;&#x53BB;&#x62FC;&#x640F;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x9886;&#x5BFC;&#x770B;&#x5F97;&#x89C1;&#x4F60;&#x7684;&#x4ED8;&#x51FA;&#x3002;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x522B;&#x4EBA;&#x505A;&#x4E0D;&#x4E86;&#xFF0C;&#x9886;&#x5BFC;&#x628A;&#x4E8B;&#x60C5;&#x4EA4;&#x5230;&#x4F60;&#x8FD9;&#x4ED6;&#x653E;&#x5FC3;&#xFF0C;&#x4F60;&#x5C31;&#x79BB;&#x52A0;&#x85AA;&#x4E0D;&#x8FDC;&#x4E86;&#xFF0C;&#x591A;&#x6B21;&#x5982;&#x6B64;&#xFF0C;&#x5C31;&#x79BB;&#x5347;&#x804C;&#x4E0D;&#x8FDC;&#x4E86;&#x3002;</p>
<h4 id="&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x9886;&#x5BFC;&#x7684;&#x5173;&#x7CFB;"><a href="#&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x9886;&#x5BFC;&#x7684;&#x5173;&#x7CFB;" class="headerlink" title="&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x9886;&#x5BFC;&#x7684;&#x5173;&#x7CFB;"></a>&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x9886;&#x5BFC;&#x7684;&#x5173;&#x7CFB;</h4><p>&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BB2;&#xFF0C;&#x4F60;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x5728;&#x4E3A;&#x516C;&#x53F8;&#x6253;&#x5DE5;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E3A;&#x4F60;&#x7684;&#x76F4;&#x5C5E;&#x4E0A;&#x53F8;&#x6253;&#x5DE5;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8DDF;&#x9886;&#x5BFC;&#x7684;&#x5173;&#x7CFB;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x641E;&#x7838;&#x4E86;&#xFF0C;&#x9886;&#x5BFC;&#x8BF4;&#x7684;&#x5BF9;&#x7684;&#xFF0C;&#x8981;&#x5168;&#x529B;&#x652F;&#x6301;&#xFF1B;&#x505A;&#x7684;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x8981;#### &#x79C1;&#x4E0B;#### &#x8DDF;&#x9886;&#x5BFC;&#x6C9F;&#x901A;&#xFF0C;&#x7528;&#x59D4;&#x5A49;&#x7684;&#x65B9;&#x5F0F;&#x5E2E;&#x4ED6;&#x6307;&#x51FA;&#x95EE;&#x9898;&#x6240;&#x5728;&#x3002;&#x5982;&#x679C;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x4F60;&#x7684;&#x9886;&#x5BFC;&#x521A;&#x610E;&#x81EA;&#x7528;&#xFF0C;&#x542C;&#x4E0D;&#x8FDB;&#x8C0F;&#x8A00;&#xFF0C;&#x90A3;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x826F;&#x79BD;&#x62E9;&#x6728;&#x800C;&#x6816;&#x3002;</p>
<h4 id="&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x540C;&#x4E8B;&#x7684;&#x5173;&#x7CFB;"><a href="#&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x540C;&#x4E8B;&#x7684;&#x5173;&#x7CFB;" class="headerlink" title="&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x540C;&#x4E8B;&#x7684;&#x5173;&#x7CFB;"></a>&#x628A;&#x63E1;&#x597D;&#x8DDF;&#x540C;&#x4E8B;&#x7684;&#x5173;&#x7CFB;</h4><p>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x8BA4;&#x77E5;&#x4E0D;&#x540C;&#xFF0C;&#x80CC;&#x666F;&#x77E5;&#x8BC6;&#x4E0D;&#x540C;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#x9762;&#x7684;&#x770B;&#x6CD5;&#x4F1A;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x5E38;&#x6001;&#x3002;&#x672C;&#x7740;&#x7406;&#x4E0D;&#x8FA8;&#x4E0D;&#x660E;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x51E1;&#x4E8B;&#x6C9F;&#x901A;&#x89E3;&#x51B3;&#xFF0C;&#x5BF9;&#x4E8B;&#x4E0D;&#x5BF9;&#x4EBA;&#xFF0C;&#x6CE8;&#x610F;&#x8868;&#x8FBE;&#x8BED;&#x6C14;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x56E2;&#x4F53;&#x4F5C;&#x6218;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5408;&#x7FA4;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x9886;&#x5BFC;&#x96BE;&#x529E;&#x3002;&#x53EA;&#x8981;&#x7ED3;&#x679C;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x5FCD;&#x8BA9;&#x4E00;&#x4E0B;&#x53C8;&#x4F55;&#x59A8;&#x3002;</p>
<h4 id="&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x8EAB;&#x7684;&#x8F6F;&#x7D20;&#x8D28;"><a href="#&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x8EAB;&#x7684;&#x8F6F;&#x7D20;&#x8D28;" class="headerlink" title="&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x8EAB;&#x7684;&#x8F6F;&#x7D20;&#x8D28;"></a>&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x8EAB;&#x7684;&#x8F6F;&#x7D20;&#x8D28;</h4><p>&#x5728;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x524D;&#x671F;&#xFF0C;&#x4E13;&#x4E1A;&#x6280;&#x672F;&#x80FD;&#x529B;&#x662F;&#x63A8;&#x5347;&#x4F60;&#x5F80;&#x4E0A;&#x8D70;&#x7684;&#x4E3B;&#x8981;&#x52A8;&#x529B;&#xFF0C;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#x671F;&#xFF0C;&#x8F6F;&#x7D20;&#x8D28;&#x5C31;&#x4F1A;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x540E;&#x671F;&#xFF0C;&#x4EBA;&#x683C;&#x9B45;&#x529B;&#x548C;&#x5F71;&#x54CD;&#x529B;&#x662F;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x3002;</p>
<h4 id="&#x84DD;&#x56FE;&#x89C4;&#x5212;&#x3001;&#x76EE;&#x6807;&#x62C6;&#x89E3;&#x3001;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3001;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;"><a href="#&#x84DD;&#x56FE;&#x89C4;&#x5212;&#x3001;&#x76EE;&#x6807;&#x62C6;&#x89E3;&#x3001;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3001;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;" class="headerlink" title="&#x84DD;&#x56FE;&#x89C4;&#x5212;&#x3001;&#x76EE;&#x6807;&#x62C6;&#x89E3;&#x3001;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3001;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;"></a>&#x84DD;&#x56FE;&#x89C4;&#x5212;&#x3001;&#x76EE;&#x6807;&#x62C6;&#x89E3;&#x3001;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3001;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;</h4><p>&#x5982;&#x679C;&#x53EA;&#x662F;&#x4F4E;&#x5934;&#x8D70;&#x8DEF;&#xFF0C;&#x4E0D;&#x62AC;&#x5934;&#x770B;&#x65B9;&#x5411;&#xFF0C;&#x5BB9;&#x6613;&#x8FF7;&#x5931;&#x3002;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x4F5C;&#x4E3A;&#x5458;&#x5DE5;&#xFF0C;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x516C;&#x53F8;&#x6218;&#x7565;&#xFF0C;&#x90E8;&#x95E8;&#x84DD;&#x56FE;&#xFF0C;&#x505A;&#x4E3A;&#x9886;&#x5BFC;&#xFF0C;&#x8981;&#x53BB;&#x4F20;&#x8FBE;&#x516C;&#x53F8;&#x6218;&#x7565;&#xFF0C;&#x90E8;&#x95E8;&#x84DD;&#x56FE;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x624D;&#x77E5;&#x9053;&#x5F80;&#x54EA;&#x4F7F;&#x52B2;&#x3002;&#x628A;&#x516C;&#x53F8;&#x76EE;&#x6807;&#x62C6;&#x6210;&#x90E8;&#x95E8;&#x76EE;&#x6807;&#xFF0C;&#x628A;&#x90E8;&#x95E8;&#x76EE;&#x6807;&#x62C6;&#x6210;&#x56E2;&#x961F;&#x76EE;&#x6807;&#xFF0C;&#x6700;&#x540E;&#x62C6;&#x6210;&#x4E2A;&#x4EBA;&#x76EE;&#x6807;&#xFF0C;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#xFF0C;&#x5DE5;&#x4F5C;&#x65B9;&#x5411;&#x624D;&#x80FD;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x6210;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x5236;&#x5B9A;&#x4E86;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF0C;&#x9879;&#x76EE;&#x3001;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x4E3A;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x7684;&#x3002;&#x8001;&#x677F;&#x8981;&#x4F60;&#x5199;&#x5468;&#x62A5;&#xFF0C;&#x8981;&#x4F60;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;&#xFF0C;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x5728;&#x505A;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;&#xFF0C;&#x6015;&#x51FA;&#x610F;&#x5916;~</p>
<h4 id="&#x77E5;&#x9053;&#x65B9;&#x5411;&#x4E86;&#x8981;&#x4F4E;&#x5934;&#x770B;&#x8DEF;"><a href="#&#x77E5;&#x9053;&#x65B9;&#x5411;&#x4E86;&#x8981;&#x4F4E;&#x5934;&#x770B;&#x8DEF;" class="headerlink" title="&#x77E5;&#x9053;&#x65B9;&#x5411;&#x4E86;&#x8981;&#x4F4E;&#x5934;&#x770B;&#x8DEF;"></a>&#x77E5;&#x9053;&#x65B9;&#x5411;&#x4E86;&#x8981;&#x4F4E;&#x5934;&#x770B;&#x8DEF;</h4><p>&#x6211;&#x4EEC;&#x6709;&#x7406;&#x60F3;&#xFF0C;&#x77E5;&#x9053;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x4F46;&#x8981;&#x60F3;&#x771F;&#x6B63;&#x843D;&#x5730;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x73B0;&#x72B6;&#xFF0C;&#x77E5;&#x9053;&#x4ECE;&#x73B0;&#x5B9E;&#x8D70;&#x5411;&#x7406;&#x60F3;&#x7684;&#x8DEF;&#x3002;&#x8131;&#x79BB;&#x4E00;&#x7EBF;&#x7684;&#x9AD8;&#x5C42;&#x5BB9;&#x6613;&#x6D3B;&#x5728;&#x7406;&#x60F3;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x5E72;&#x6D3B;&#x7684;&#x4EBA;&#xFF0C;&#x5374;&#x4E0D;&#x80FD;&#x9760;&#x7406;&#x60F3;&#xFF0C;&#x9760;&#x65B9;&#x6CD5;&#x8BBA;&#x6D3B;&#x7740;&#xFF0C;&#x5236;&#x5B9A;&#x51FA;&#x8FD9;&#x6761;&#x8DEF;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8DEF;&#x7684;&#x8D70;&#x6CD5;&#x540C;&#x6B65;&#x7ED9;&#x4F60;&#x7684;&#x8001;&#x677F;&#xFF0C;&#x5F97;&#x5230;&#x8001;&#x677F;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x575A;&#x5B9A;&#x7684;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x8DEF;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x624D;&#x80FD;&#x6700;&#x7EC8;&#x8FBE;&#x6210;&#x76EE;&#x6807;&#x3002;</p>
<h4 id="&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x5FC5;&#x6709;&#x56DE;&#x54CD;"><a href="#&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x5FC5;&#x6709;&#x56DE;&#x54CD;" class="headerlink" title="&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x5FC5;&#x6709;&#x56DE;&#x54CD;"></a>&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x5FC5;&#x6709;&#x56DE;&#x54CD;</h4><p>&#x5168;&#x8EAB;&#x5FC3;&#x7684;&#x6295;&#x5165;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x91CF;&#x8D85;&#x4E4E;&#x60F3;&#x8C61;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x767E;&#x601D;&#x4E0D;&#x5F97;&#x5176;&#x89E3;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x8D70;&#x7740;&#x60F3;&#xFF0C;&#x505A;&#x7740;&#x60F3;&#xFF0C;&#x5403;&#x996D;&#x60F3;&#xFF0C;&#x7761;&#x524D;&#x60F3;&#xFF0C;&#x7136;&#x540E;&#x67D0;&#x5929;&#x65E9;&#x4E0A;&#x9192;&#x6765;&#xFF0C;&#x7075;&#x5149;&#x4E4D;&#x73B0;&#xFF0C;&#x5F97;&#x51FA;&#x4E00;&#x5B8C;&#x7F8E;&#x65B9;&#x6848;&#x3002;&#x5FCD;&#x4E0D;&#x4F4F;&#x90FD;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x806A;&#x660E;&#x624D;&#x667A;&#x9F13;&#x9F13;&#x638C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#x5FC5;&#x6709;&#x56DE;&#x54CD;&#x3002;&#x8001;&#x5929;&#x7737;&#x987E;&#x52AA;&#x529B;&#x7684;&#x4EBA;&#x3002;</p>
<h4 id="&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;"><a href="#&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;" class="headerlink" title="&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;"></a>&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;</h4><p>&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x60F3;&#x9886;&#x5BFC;&#x4E4B;&#x6240;&#x60F3;&#xFF0C;&#x8001;&#x677F;&#x628A;&#x4EFB;&#x52A1;&#x62C6;&#x89E3;&#x597D;&#x4E86;&#xFF0C;&#x8DDF;&#x5927;&#x4F19;&#x5236;&#x5B9A;&#x4E86;&#x8FBE;&#x6210;&#x76EE;&#x6807;&#x7684;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF0C;&#x624B;&#x4E0B;&#x4EBA;&#x53BB;&#x5E72;&#x6D3B;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8001;&#x677F;&#x4F1A;&#x5173;&#x6CE8;&#x4EC0;&#x4E48;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x8001;&#x677F;&#x60F3;&#x77E5;&#x9053;&#x5404;&#x4F4D;&#x5E72;&#x5F97;&#x5982;&#x4F55;&#x4E86;&#xFF0C;&#x662F;&#x5426;&#x9047;&#x5230;&#x96BE;&#x70B9;&#xFF0C;&#x51FA;&#x73B0;&#x610F;&#x5916;&#xFF0C;&#x5F71;&#x54CD;&#x9879;&#x76EE;&#x8FDB;&#x5C55;&#xFF0C;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#xFF0C;&#x8FD8;&#x5DEE;&#x54EA;&#x4E9B;&#x2026;&#x2026;&#x6240;&#x4EE5;&#xFF0C;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x7ECF;&#x5E38;&#x6C47;&#x62A5;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x6EF4;&#xFF0C;&#x8001;&#x677F;&#x4F1A;&#x89C9;&#x5F97;&#x4F60;&#x5F88;&#x4E0A;&#x8FDB;&#xFF0C;&#x5F88;&#x79EF;&#x6781;&#x3002;&#x4F46;&#x8001;&#x662F;&#x62FF;&#x4E2A;PPT&#x53BB;&#x7ED9;&#x8001;&#x677F;&#x8BB2;&#xFF0C;&#x5F88;&#x4E0D;&#x7CFB;&#x7EDF;&#x5316;&#xFF0C;&#x4E5F;&#x4E0D;&#x4FBF;&#x4E8E;&#x8001;&#x677F;&#x8DDF;&#x8E2A;&#xFF0C;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p><img src="/images/sh.jpg" width="100%" height="70%"></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    </div>

    

    
        <div class="post-tags">
            <i class="fa fa-tags" aria-hidden="true"></i>
            <a href="/tags/职业规划/">#职业规划</a>
        </div>
    

    <!-- Comments -->
    

</div>
        </section>

    </div>
</div>


</div>

<!-- Footer -->
<div class="push"></div>

<footer class="footer-content">
    <div class="container">
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-6 col-lg-6 footer-about">
                <h2>About</h2>
                <p>
                    Failure is never quite so frightening as regret.
                </p>
            </div>
            
    <div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 recent-posts">
        <h2>Recent Posts</h2>
        <ul>
            
            <li>
                <a class="footer-post" href="/AWS/2018/05/29/搭建grafana-on-AWS-Ubuntu-Instance.html">Install And Configure Gra</a>
            </li>
            
            <li>
                <a class="footer-post" href="/AWS/2018/02/06/配置适用于Lambda函数的AWS环境NAT网关-从VPC访问Intelnet公共网络.html">配置适用于Lambda函数的AWS环境NAT网关-</a>
            </li>
            
            <li>
                <a class="footer-post" href="/职业规划/2018/01/01/做一个职业运维人.html">做一个职业运维人</a>
            </li>
            
            <li>
                <a class="footer-post" href="/职业规划/2017/07/17/运维的价值与目标拆解.html">运维的价值与目标拆解</a>
            </li>
            
        </ul>
    </div>



            
<div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 footer-categories">
    <h2>Categories</h2>
    <ul>
        
        <li>
            <a class="footer-post" href="/categories/Linux/">Linux</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/Git/">Git</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/MySQL/">MySQL</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/AWS/">AWS</a>
        </li>
        
    </ul>
</div>

        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <ul class="list-inline footer-social-icons">
                    
                    <li class="list-inline-item">
                        <a href="https://github.com/wolf-7">
                            <span class="footer-icon-container">
                                <i class="fa fa-github"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    <li class="list-inline-item">
                        <a href="mailto:unix917@gmail.com">
                            <span class="footer-icon-container">
                                <i class="fa fa-envelope-o"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                </ul>
            </div>
        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <div class="footer-copyright">
                    © 2015-2019 | <a href="http://wolf-7.github.io/">wolf7.org</a>
                </div>
            </div>
        </div>
    </div>
</footer>

<!-- After footer scripts -->

<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Tween Max -->
<script src="//cdnjs.cloudflare.com/ajax/libs/gsap/1.18.5/TweenMax.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Custom JavaScript -->
<script src="/js/main.js"></script>

<!-- Disqus Comments -->



</body>

</html>