<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。">
    

    <!--Author-->
    
        <meta name="author" content="一匹来自北方的狼">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="运维的价值与目标拆解"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="一匹来自北方的狼"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

    <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>运维的价值与目标拆解 - 一匹来自北方的狼</title>

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0-alpha.2/css/bootstrap.min.css" integrity="sha384-y3tfxAZXuh4HwSYylfB+J125MxIs6mR5FOHamPBG064zB+AFeWH94NdvaCBm8qnd" crossorigin="anonymous">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Google Analytics -->
    


</head>


<body>

<div class="bg-gradient"></div>
<div class="bg-pattern"></div>

<!-- Menu -->
<!--Menu Links and Overlay-->
<div class="menu-bg">
    <div class="menu-container">
        <ul>
            
            <li class="menu-item">
                <a href="/">
                    Home
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/archives">
                    Archives
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/categories">
                    Categories
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/tags">
                    Tags
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/about">
                    About
                </a>
            </li>
            
        </ul>
    </div>
</div>

<!--Hamburger Icon-->
<nav>
    <a href="#menu"></a>
</nav>

<div class="container">

    <!-- Main Content -->
    <div class="row">
    <div class="col-sm-12">

        <!--Title and Logo-->
        <header>
    <div class="logo">
        <a href="/"><i class="logo-icon fa fa-cube" aria-hidden="true"></i></a>
        
    </div>
</header>

        <section class="main">
            
<div class="post">

    <div class="post-header">
        <h1 class="title">
            <a href="/职业规划/2017/07/17/运维的价值与目标拆解.html">
                运维的价值与目标拆解
            </a>
        </h1>
        <div class="post-info">
            
                <span class="date">2017-07-17</span>
            
            
            
                <span class="category">
                    <a href="/categories/职业规划/">职业规划</a>
                </span>
            
        </div>
    </div>

    <div class="content">

        <!-- Gallery -->
        

        <!-- Post Content -->
        <hr>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x8FD0;&#x7EF4;&#x4E3B;&#x8981;&#x662F;&#x6307;&#x5E94;&#x7528;&#x8FD0;&#x7EF4;&#xFF0C;&#x975E;&#x7CFB;&#x7EDF;&#x90E8;&#x7684;&#x504F;&#x786C;&#x4EF6;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x8FD0;&#x7EF4;</p>
<hr>
<a id="more"></a>
<h3 id="&#x6211;&#x4E0D;&#x5E78;&#x798F;"><a href="#&#x6211;&#x4E0D;&#x5E78;&#x798F;" class="headerlink" title="&#x6211;&#x4E0D;&#x5E78;&#x798F;"></a>&#x6211;&#x4E0D;&#x5E78;&#x798F;</h3><p>&#x5F88;&#x591A;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5F88;&#x82E6;&#x903C;&#xFF0C;&#x611F;&#x89C9;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x6551;&#x706B;&#xFF0C;&#x7ED9;&#x7814;&#x53D1;&#x64E6;&#x5C41;&#x80A1;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x91CD;&#x590D;&#x5DE5;&#x4F5C;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x5BF9;&#x81EA;&#x5DF1;&#x63D0;&#x5347;&#x8F83;&#x5C0F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x5E78;&#x798F;&#x3002;</p>
<h3 id="&#x600E;&#x4E48;&#x5E78;&#x798F;"><a href="#&#x600E;&#x4E48;&#x5E78;&#x798F;" class="headerlink" title="&#x600E;&#x4E48;&#x5E78;&#x798F;"></a>&#x600E;&#x4E48;&#x5E78;&#x798F;</h3><p>&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x5E78;&#x798F;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x4E24;&#x70B9;&#xFF1A;</p>
<p>1&#x3001;&#x6709;&#x6210;&#x5C31;&#x611F;&#xFF1B;<br>2&#x3001;&#x85AA;&#x6C34;&#x5230;&#x4F4D;&#xFF1B;</p>
<p>&#x800C;&#x85AA;&#x6C34;&#x5230;&#x4F4D;&#x4E0E;&#x5426;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x51B3;&#x5B9A;&#x4E8E;&#x4F60;&#x7684;&#x4EA7;&#x51FA;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8001;&#x677F;&#x4E0D;&#x61C2;&#x4F60;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x770B;&#x4E0D;&#x5230;&#x672C;&#x8BE5;&#x770B;&#x5230;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x90A3;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#xFF09;&#xFF0C;&#x800C;&#x4EA7;&#x51FA;&#x591A;&#x5C11;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x548C;&#x4F60;&#x7684;&#x6210;&#x5C31;&#x611F;&#x662F;&#x6B63;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x5E78;&#x798F;&#xFF0C;&#x5C31;&#x8981;&#x505A;&#x6709;&#x6210;&#x5C31;&#x611F;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h3 id="&#x8C08;&#x6210;&#x5C31;&#x611F;"><a href="#&#x8C08;&#x6210;&#x5C31;&#x611F;" class="headerlink" title="&#x8C08;&#x6210;&#x5C31;&#x611F;"></a>&#x8C08;&#x6210;&#x5C31;&#x611F;</h3><p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x4EBA;&#x5458;&#xFF0C;&#x6210;&#x5C31;&#x611F;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x4E24;&#x70B9;&#xFF1A;</p>
<p>1&#x3001;&#x505A;&#x7684;&#x6709;&#x4EF7;&#x503C;<br>2&#x3001;&#x88AB;&#x522B;&#x4EBA;&#x8BA4;&#x540C;</p>
<p>&#x5BF9;&#x4E8E;&#x7814;&#x53D1;&#x540C;&#x5B66;&#xFF0C;&#x6BD4;&#x5982;&#x5199;&#x4E86;&#x4E00;&#x4E2A;framework&#xFF0C;&#x6216;&#x8005;lib&#xFF0C;&#x540C;&#x4E8B;&#x90FD;&#x8BF4;&#x597D;&#xFF0C;&#x5E76;&#x62FF;&#x53BB;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x662F;&#x8D85;&#x7EA7;&#x6709;&#x6210;&#x5C31;&#x611F;&#x7684;&#xFF1B;&#x6216;&#x8005;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#x88AB;&#x5E02;&#x573A;&#x8BA4;&#x53EF;&#xFF0C;&#x88AB;&#x540C;&#x884C;&#x8BA4;&#x53EF;&#xFF0C;&#x4E5F;&#x662F;&#x5F88;&#x6709;&#x6210;&#x5C31;&#x611F;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x5462;&#xFF1F;&#x4EF7;&#x503C;&#x4F53;&#x73B0;&#x5728;&#x54EA;&#x91CC;&#xFF1F;</p>
<p>&#x8FD0;&#x7EF4;&#x7684;&#x4EF7;&#x503C;<br>&#x53EF;&#x4EE5;&#x5206;&#x5BF9;&#x5185;&#x7684;&#xFF0C;&#x548C;&#x5BF9;&#x5916;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x5199;&#x4E86;&#x4E00;&#x4E9B;&#x8FD0;&#x7EF4;&#x5DE5;&#x5177;&#xFF0C;&#x5927;&#x5927;&#x63D0;&#x5347;&#x4E86;&#x505A;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x5F97;&#x5230;&#x5468;&#x8FB9;&#x540C;&#x5B66;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x5185;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x7B14;&#x8005;&#x66F4;&#x5E0C;&#x671B;&#x597D;&#x597D;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#x5BF9;&#x5916;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x8FD0;&#x7EF4;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x7684;&#x5B9A;&#x4F4D;&#xFF0C;&#x5BF9;&#x516C;&#x53F8;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x591A;&#x6570;&#x516C;&#x53F8;&#x5728;&#x521B;&#x4E1A;&#x4E4B;&#x521D;&#xFF0C;&#x662F;&#x6CA1;&#x6709;&#x8FD0;&#x7EF4;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#xFF0C;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x7531;&#x6240;&#x8C13;&#x7684;&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x3001;&#x6808;&#x6EA2;&#x51FA;&#x5DE5;&#x7A0B;&#x5E08;&#x4EE3;&#x52B3;&#x3002;&#x968F;&#x7740;&#x516C;&#x53F8;&#x89C4;&#x6A21;&#x6269;&#x5927;&#xFF0C;&#x673A;&#x5668;&#x5230;&#x51E0;&#x767E;&#x53F0;&#xFF0C;&#x4F1A;&#x66B4;&#x9732;&#x51FA;N&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x8F83;&#x76F4;&#x89C2;&#x7684;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7EBF;&#x4E0A;&#x73AF;&#x5883;&#x6DF7;&#x4E71;&#x4E0D;&#x582A;&#xFF0C;OS&#x53D1;&#x884C;&#x7248;&#x3001;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#x3001;WEB&#x670D;&#x52A1;&#x5668;&#x3001;&#x542F;&#x505C;&#x65B9;&#x5F0F;&#x3001;&#x90E8;&#x7F72;&#x8DEF;&#x5F84;&#x5168;&#x51ED;&#x5404;&#x670D;&#x52A1;&#x7684;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x559C;&#x597D;&#x548C;&#x719F;&#x6089;&#x7A0B;&#x5EA6;</li>
<li>&#x76D1;&#x63A7;&#x5404;&#x79CD;&#x4E0D;&#x5B8C;&#x5907;&#xFF0C;&#x5F88;&#x591A;&#x6545;&#x969C;&#x90FD;&#x662F;&#x540E;&#x4E8E;&#x7528;&#x6237;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E9B;&#x8FDB;&#x7A0B;&#x6302;&#x4E86;&#x597D;&#x4E45;&#x624D;&#x5076;&#x7136;&#x53D1;&#x73B0;&#x6216;&#x7528;&#x6237;&#x62A5;&#x969C;&#x4E86;&#x624D;&#x53D1;&#x73B0;</li>
<li>&#x51FA;&#x4E86;&#x6545;&#x969C;&#x6392;&#x67E5;&#x8D39;&#x52B2;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x7EBF;&#x4E0A;&#x8C03;&#x8BD5;</li>
<li>&#x5F88;&#x591A;&#x6545;&#x969C;&#x90FD;&#x662F;&#x7531;&#x4E00;&#x4E9B;&#x4F4E;&#x7EA7;&#x95EE;&#x9898;&#x5BFC;&#x81F4;&#xFF0C;&#x6BD4;&#x5982;ulimit&#x914D;&#x7F6E;&#x4E0D;&#x5408;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x60F3;&#x56DE;&#x6EDA;&#x5374;&#x53D1;&#x73B0;&#x5FD8;&#x8BB0;&#x5907;&#x4EFD;</li>
<li>&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x4F4E;&#xFF0C;&#x5F88;&#x591A;&#x673A;&#x5668;&#x6839;&#x672C;&#x6CA1;&#x5728;&#x7528;&#xFF0C;&#x751A;&#x81F3;&#x90FD;&#x627E;&#x4E0D;&#x5230;&#x4E86;&#xFF0C;&#x6D6A;&#x8D39;&#x4E86;&#x5927;&#x91CF;&#x786C;&#x4EF6;&#x6210;&#x672C;</li>
<li>&#x540C;&#x65F6;&#x64CD;&#x4F5C;&#x5927;&#x91CF;&#x673A;&#x5668;&#x7F3A;&#x4E4F;&#x6709;&#x529B;&#x5DE5;&#x5177;&#xFF0C;&#x7EBF;&#x4E0A;&#x6743;&#x9650;&#x8981;&#x4E48;&#x6DF7;&#x4E71;&#x4E0D;&#x582A;&#xFF0C;&#x8981;&#x4E48;&#x6240;&#x6709;&#x4EBA;&#x6709;&#x6240;&#x6709;&#x673A;&#x5668;&#x7684;&#x6743;&#x9650;</li>
</ul>
<p>&#x6280;&#x672F;&#x5408;&#x4F19;&#x4EBA;&#x610F;&#x8BC6;&#x5230;&#xFF1A;&#x9760;&#x4E13;&#x6CE8;&#x5199;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x804C;&#x80FD;&#x56E2;&#x961F;&#x6765;&#x6536;&#x62FE;&#x8FD9;&#x4E2A;&#x70C2;&#x644A;&#x5B50;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x8FD0;&#x7EF4;&#x56E2;&#x961F;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x5B9A;&#x4F4D;&#x5C31;&#x662F;&#xFF1A;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6362;&#x4E2A;&#x8BF4;&#x6CD5;&#xFF1A;&#x8BA9;&#x7814;&#x53D1;&#x53EA;&#x4E13;&#x6CE8;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD0;&#x7EF4;&#x641E;&#x5B9A;&#x5269;&#x4E0B;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x5E26;&#x6765;&#x4EE5;&#x4E0B;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li>&#x4EA7;&#x54C1;&#x66F4;&#x5FEB;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#xFF1A;&#x89E3;&#x653E;&#x4E86;&#x7814;&#x53D1;&#x4EBA;&#x529B;&#xFF0C;&#x7814;&#x53D1;&#x540C;&#x5B66;&#x5C31;&#x53EF;&#x4EE5;&#x5168;&#x8EAB;&#x5FC3;&#x6251;&#x5728;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x4E0A;&#xFF0C;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x4F1A;&#x53D8;&#x5FEB;</li>
<li>&#x5927;&#x5E45;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#xFF1A;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x5E72;&#x4E13;&#x4E1A;&#x7684;&#x4E8B;&#xFF0C;&#x7EBF;&#x4E0A;&#x73AF;&#x5883;&#x89C4;&#x8303;&#x5E72;&#x51C0;&#x4E86;&#xFF0C;&#x76D1;&#x63A7;&#x5B8C;&#x5907;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#x4E86;&#xFF0C;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#x5408;&#x7406;&#x4E86;</li>
<li>&#x8D44;&#x4EA7;&#x5F97;&#x5230;&#x6709;&#x6548;&#x5229;&#x7528;&#xFF1A;&#x8D44;&#x4EA7;&#x4E13;&#x95E8;&#x6709;&#x4EBA;&#x5728;&#x68B3;&#x7406;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x6DF7;&#x90E8;&#x7B49;&#x624B;&#x6BB5;&#x63D0;&#x9AD8;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x518D;&#x4E5F;&#x6CA1;&#x6709;&#x673A;&#x5668;&#x5728;&#x7A7A;&#x8F6C;</li>
</ul>
<blockquote>
<font color="wihte" size="4"> &#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x6982;&#x51B5;&#x8FD0;&#x7EF4;&#x7684;&#x4EF7;&#x503C;: </font><br><font color="red" size="4"> &#x82B1;&#x66F4;&#x5C11;&#x7684;&#x94B1;&#xFF0C;&#x8BA9;&#x4EA7;&#x54C1;&#x66F4;&#x5FEB;&#x8FED;&#x4EE3;&#xFF0C;&#x66F4;&#x7A33;&#x5B9A;&#x8FD0;&#x884C; </font>

</blockquote>
<p>&#x2003;<br>&#x6709;&#x4E9B;&#x8FD0;&#x7EF4;&#x540C;&#x4EC1;&#x6982;&#x51B5;&#x4E86;&#x8FD0;&#x7EF4;&#x4E5D;&#x5B57;&#x771F;&#x8A00;&#x201C;&#x5B89;&#x5168;&#x7A33;&#x5B9A;&#x9AD8;&#x6548;&#x4F4E;&#x6210;&#x672C;&#x201D;&#xFF0C;&#x8BF4;&#x7684;&#x975E;&#x5E38;&#x5230;&#x4F4D;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x884C;&#x6587;&#x5230;&#x6B64;&#x5C1A;&#x672A;&#x4ECB;&#x7ECD;&#x5230;&#xFF0C;&#x6709;&#x4E9B;&#x516C;&#x53F8;&#x4F1A;&#x628A;&#x5B89;&#x5168;&#x5355;&#x62CE;&#x51FA;&#x6765;&#x6210;&#x7ACB;&#x5B89;&#x5168;&#x90E8;&#xFF0C;&#x6709;&#x4E9B;&#x5C31;&#x76F4;&#x63A5;&#x653E;&#x5728;&#x8FD0;&#x7EF4;&#x56E2;&#x961F;&#xFF0C;&#x8FD9;&#x4E2A;&#x770B;&#x516C;&#x53F8;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x516C;&#x53F8;&#x4F53;&#x91CF;&#x5927;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD8;&#x662F;&#x5355;&#x62CE;&#x51FA;&#x6765;&#x4F1A;&#x597D;&#x4E00;&#x4E9B;&#x3002;</p>
<h3 id="&#x76EE;&#x6807;&#x62C6;&#x89E3;"><a href="#&#x76EE;&#x6807;&#x62C6;&#x89E3;" class="headerlink" title="&#x76EE;&#x6807;&#x62C6;&#x89E3;"></a>&#x76EE;&#x6807;&#x62C6;&#x89E3;</h3><p>&#x5B89;&#x5168;&#x3001;&#x7A33;&#x5B9A;&#x3001;&#x9AD8;&#x6548;&#x3001;&#x4F4E;&#x6210;&#x672C;&#xFF0C;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x628A;&#x8FD9;&#x56DB;&#x5927;&#x76EE;&#x6807;&#x505A;&#x597D;&#xFF1F;&#x5E94;&#x8BE5;&#x505A;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#x6765;&#x8FBE;&#x6210;&#x76EE;&#x6807;&#xFF1F;&#x7B14;&#x8005;&#x7528;&#x4E00;&#x5F20;&#x8111;&#x56FE;&#x6765;&#x68B3;&#x7406;&#x4E00;&#x4E0B;&#xFF1A;</p>
<h3 id="&#x8FD0;&#x7EF4;&#x76EE;&#x6807;&#x62C6;&#x89E3;"><a href="#&#x8FD0;&#x7EF4;&#x76EE;&#x6807;&#x62C6;&#x89E3;" class="headerlink" title="&#x8FD0;&#x7EF4;&#x76EE;&#x6807;&#x62C6;&#x89E3;"></a>&#x8FD0;&#x7EF4;&#x76EE;&#x6807;&#x62C6;&#x89E3;</h3><p><img src="/images/operation-2.jpg" width="100%" height="80%"></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    </div>

    

    
        <div class="post-tags">
            <i class="fa fa-tags" aria-hidden="true"></i>
            <a href="/tags/职业规划/">#职业规划</a>
        </div>
    

    <!-- Comments -->
    

</div>
        </section>

    </div>
</div>


</div>

<!-- Footer -->
<div class="push"></div>

<footer class="footer-content">
    <div class="container">
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-6 col-lg-6 footer-about">
                <h2>About</h2>
                <p>
                    Failure is never quite so frightening as regret.
                </p>
            </div>
            
    <div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 recent-posts">
        <h2>Recent Posts</h2>
        <ul>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/错误预算上线机制.html">错误预算上线机制</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/Moosefs概念总结.html">Moosefs概念总结</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/linux下编译安装Python环境与iPython.html">linux下编译安装Python环境与iPytho</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/Linux下如何选择文件系统：EXT4、Btrfs-和-XFS.html">Linux下如何选择文件系统：EXT4、Btrfs</a>
            </li>
            
        </ul>
    </div>



            
<div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 footer-categories">
    <h2>Categories</h2>
    <ul>
        
        <li>
            <a class="footer-post" href="/categories/Linux/">Linux</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/Git/">Git</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/MySQL/">MySQL</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/AWS/">AWS</a>
        </li>
        
    </ul>
</div>

        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <ul class="list-inline footer-social-icons">
                    
                    <li class="list-inline-item">
                        <a href="https://github.com/wolf-7">
                            <span class="footer-icon-container">
                                <i class="fa fa-github"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    <li class="list-inline-item">
                        <a href="mailto:91unix@sina.cn">
                            <span class="footer-icon-container">
                                <i class="fa fa-envelope-o"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                </ul>
            </div>
        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <div class="footer-copyright">
                    © 2015-2019 | <a href="http://wolf7.org/">wolf7.org</a>
                </div>
            </div>
        </div>
    </div>
</footer>

<!-- After footer scripts -->

<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Tween Max -->
<script src="//cdnjs.cloudflare.com/ajax/libs/gsap/1.18.5/TweenMax.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Custom JavaScript -->
<script src="/js/main.js"></script>

<!-- Disqus Comments -->



</body>

</html>