<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。">
    

    <!--Author-->
    
        <meta name="author" content="一匹来自北方的狼">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="Linux下如何选择文件系统：EXT4、Btrfs 和 XFS"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="一匹来自北方的狼"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

    <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>Linux下如何选择文件系统：EXT4、Btrfs 和 XFS - 一匹来自北方的狼</title>

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0-alpha.2/css/bootstrap.min.css" integrity="sha384-y3tfxAZXuh4HwSYylfB+J125MxIs6mR5FOHamPBG064zB+AFeWH94NdvaCBm8qnd" crossorigin="anonymous">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Google Analytics -->
    


</head>


<body>

<div class="bg-gradient"></div>
<div class="bg-pattern"></div>

<!-- Menu -->
<!--Menu Links and Overlay-->
<div class="menu-bg">
    <div class="menu-container">
        <ul>
            
            <li class="menu-item">
                <a href="/">
                    Home
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/archives">
                    Archives
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/categories">
                    Categories
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/tags">
                    Tags
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/about">
                    About
                </a>
            </li>
            
        </ul>
    </div>
</div>

<!--Hamburger Icon-->
<nav>
    <a href="#menu"></a>
</nav>

<div class="container">

    <!-- Main Content -->
    <div class="row">
    <div class="col-sm-12">

        <!--Title and Logo-->
        <header>
    <div class="logo">
        <a href="/"><i class="logo-icon fa fa-cube" aria-hidden="true"></i></a>
        
    </div>
</header>

        <section class="main">
            
<div class="post">

    <div class="post-header">
        <h1 class="title">
            <a href="/uncategorized/2019/01/24/Linux下如何选择文件系统：EXT4、Btrfs-和-XFS.html">
                Linux下如何选择文件系统：EXT4、Btrfs 和 XFS
            </a>
        </h1>
        <div class="post-info">
            
                <span class="date">2019-01-24</span>
            
            
            
        </div>
    </div>

    <div class="content">

        <!-- Gallery -->
        

        <!-- Post Content -->
        <a id="more"></a>
<p>&#x8001;&#x5B9E;&#x8BF4;&#xFF0C;&#x4EBA;&#x4EEC;&#x6700;&#x4E0D;&#x66FE;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;Windows &#x548C; Mac OS X &#x7528;&#x6237;&#x66F4;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#xFF0C;&#x90A3;&#x5C31;&#x662F; NTFS &#x548C; HFS+&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5BF9;&#x4E8E; Linux &#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#xFF0C;&#x73B0;&#x5728;&#x9ED8;&#x8BA4;&#x7684;&#x662F;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x7684; ext4&#x3002;&#x7136;&#x800C;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x6709;&#x6539;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A; btrfs &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x90A3;&#x662F;&#x4EC0;&#x4E48;&#x4F7F;&#x5F97; btrfs &#x66F4;&#x4F18;&#x79C0;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53C8;&#x80FD;&#x770B;&#x5230; Linux &#x53D1;&#x884C;&#x7248;&#x4F5C;&#x51FA;&#x6539;&#x53D8;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x771F;&#x6B63;&#x5E72;&#x4EC0;&#x4E48;&#x6709;&#x4E2A;&#x603B;&#x4F53;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x5BF9;&#x4E00;&#x4E9B;&#x6709;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x505A;&#x8BE6;&#x7EC6;&#x7684;&#x6BD4;&#x8F83;&#x3002;</p>
<h2 id="&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;"><a href="#&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;" class="headerlink" title="&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;"></a>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;</h2><p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x6E05;&#x695A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#x8D77;&#x6765;&#x4E5F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x65F6;&#x5982;&#x4F55;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3001;&#x5982;&#x4F55;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x6709;&#x4EC0;&#x4E48;&#x5176;&#x5B83;&#x4FE1;&#x606F;&#xFF08;&#x5143;&#x6570;&#x636E;&#xFF09;&#x548C;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x76F8;&#x5173;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x542C;&#x8D77;&#x6765;&#x8981;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x662F;&#x8F7B;&#x800C;&#x6613;&#x4E3E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x3002;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E00;&#x76F4;&#x5728;&#x6539;&#x8FDB;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x529F;&#x80FD;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x5B8C;&#x6210;&#x5B83;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5B83;&#x662F;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x57FA;&#x672C;&#x9700;&#x6C42;&#x3001;&#x4F46;&#x5E76;&#x4E0D;&#x50CF;&#x542C;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x533A;&#xFF1F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x533A;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x533A;&#xFF1F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x533A;&#xFF1F;</h2><p>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x80FD;&#x521B;&#x5EFA;&#x6216;&#x8005;&#x5220;&#x9664;&#x5206;&#x533A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;&#x5206;&#x533A;&#x90FD;&#x6709;&#x6A21;&#x7CCA;&#x7684;&#x8BA4;&#x8BC6;&#x3002;Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5373;&#x4FBF;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x5757;&#x78C1;&#x76D8;&#x4E0A;&#x4ECD;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x89E3;&#x91CA;&#x3002;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x5206;&#x533A;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x707E;&#x96BE;&#x53D1;&#x751F;&#x65F6;&#x80FD;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6570;&#x636E;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5C06;&#x786C;&#x76D8;&#x5212;&#x5206;&#x4E3A;&#x5206;&#x533A;&#xFF0C;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x5206;&#x9694;&#x4EE5;&#x53CA;&#x91CD;&#x7EC4;&#x3002;&#x5F53;&#x4E8B;&#x6545;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x6709;&#x5B58;&#x50A8;&#x5728;&#x88AB;&#x635F;&#x574F;&#x5206;&#x533A;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x7834;&#x574F;&#xFF0C;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x4E0A;&#x5176;&#x5B83;&#x5206;&#x533A;&#x7684;&#x6570;&#x636E;&#x80FD;&#x5F97;&#x4EE5;&#x4FDD;&#x7559;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FD8;&#x6CA1;&#x6709;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x4EFB;&#x4F55;&#x7535;&#x529B;&#x6545;&#x969C;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x707E;&#x96BE;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5206;&#x533A;&#x4E5F;&#x8003;&#x8651;&#x5230;&#x4E86;&#x5B89;&#x5168;&#x548C;&#x5065;&#x58EE;&#x6027;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x6B64;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90E8;&#x5206;&#x635F;&#x574F;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x6709;&#x98CE;&#x9669;&#x6216;&#x8005;&#x4F1A;&#x53D7;&#x5230;&#x7834;&#x574F;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5F53;&#x524D;&#x91C7;&#x7528;&#x5206;&#x533A;&#x7684;&#x4E00;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E9B;&#x4F1A;&#x586B;&#x6EE1;&#x78C1;&#x76D8;&#x7684;&#x811A;&#x672C;&#x3001;&#x7A0B;&#x5E8F;&#x6216;&#x8005; web &#x5E94;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x78C1;&#x76D8;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5206;&#x533A;&#xFF0C;&#x5982;&#x679C;&#x78C1;&#x76D8;&#x6EE1;&#x4E86;&#x90A3;&#x4E48;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5C31;&#x4E0D;&#x80FD;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x628A;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EA;&#x6709;&#x90A3;&#x4E2A;&#x5206;&#x533A;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x7CFB;&#x7EDF;&#x5206;&#x533A;&#x6216;&#x8005;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5206;&#x533A;&#x4ECD;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x8BB0;&#x4F4F;&#xFF0C;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x5728;&#x6389;&#x7535;&#x6216;&#x8005;&#x548C;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x610F;&#x5916;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x65F6;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x574F;&#x5757;&#x6216;&#x8005;&#x53D1;&#x751F;&#x903B;&#x8F91;&#x9519;&#x8BEF;&#x65F6;&#x4FDD;&#x62A4;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5EC9;&#x4EF7;&#x78C1;&#x76D8;&#x5197;&#x4F59;&#x9635;&#x5217;&#xFF08;RAID&#xFF1A;Redundant Array of Inexpensive Disks&#xFF09;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5207;&#x6362;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF1F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5207;&#x6362;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5207;&#x6362;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF1F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5207;&#x6362;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF1F;</h2><p>ext4 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7531; ext3 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6539;&#x8FDB;&#x800C;&#x6765;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x53C8;&#x662F;&#x4ECE; ext2 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6539;&#x8FDB;&#x800C;&#x6765;&#x3002;&#x867D;&#x7136; ext4 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x7A33;&#x5B9A;&#xFF0C;&#x662F;&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x4E2D;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x53D1;&#x884C;&#x7248;&#x7684;&#x9ED8;&#x8BA4;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x9648;&#x65E7;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x800C;&#x6765;&#x3002;&#x53E6;&#x5916;&#xFF0C; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7528;&#x6237;&#x4E5F;&#x9700;&#x8981;&#x5F88;&#x591A; ext4 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x4E0D;&#x63D0;&#x4F9B;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x867D;&#x7136;&#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x8F6F;&#x4EF6;&#x80FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x6027;&#x80FD;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5C42;&#x6B21;&#x505A;&#x5230;&#x8FD9;&#x4E9B;&#x80FD;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h2 id="Ext4-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#Ext4-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="Ext4 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>Ext4 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2><p>ext4 &#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x660E;&#x663E;&#x7684;&#x9650;&#x5236;&#x3002;&#x6700;&#x5927;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x662F; 16 tebibytes&#xFF08;&#x5927;&#x6982;&#x662F; 17.6 terabytes&#xFF09;&#xFF0C;&#x8FD9;&#x6BD4;&#x666E;&#x901A;&#x7528;&#x6237;&#x5F53;&#x524D;&#x80FD;&#x4E70;&#x5230;&#x7684;&#x786C;&#x76D8;&#x8FD8;&#x8981;&#x5927;&#x7684;&#x591A;&#x3002;&#x4F7F;&#x7528; ext4 &#x80FD;&#x521B;&#x5EFA;&#x7684;&#x6700;&#x5927;&#x5377;/&#x5206;&#x533A;&#x662F; 1 exbibyte&#xFF08;&#x5927;&#x6982;&#x662F; 1,152,921.5 terabytes&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x6280;&#x5DE7;&#xFF0C; ext4 &#x6BD4; ext3 &#x6709;&#x5F88;&#x5927;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;&#x7C7B;&#x4F3C;&#x4E00;&#x4E9B;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4F1A;&#x5BF9;&#x6587;&#x4EF6;&#x5728;&#x78C1;&#x76D8;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x5BF9;&#x78C1;&#x76D8;&#x7684;&#x66F4;&#x6539;&#x505A;&#x8BB0;&#x5F55;&#x3002;&#x7EB5;&#x89C2;&#x5B83;&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x8FD8;&#x4E0D;&#x652F;&#x6301;&#x900F;&#x660E;&#x538B;&#x7F29;&#x3001;&#x91CD;&#x590D;&#x6570;&#x636E;&#x5220;&#x9664;&#x6216;&#x8005;&#x900F;&#x660E;&#x52A0;&#x5BC6;&#x3002;&#x6280;&#x672F;&#x4E0A;&#x652F;&#x6301;&#x4E86;&#x5FEB;&#x7167;&#xFF0C;&#x4F46;&#x8BE5;&#x529F;&#x80FD;&#x8FD8;&#x5904;&#x4E8E;&#x5B9E;&#x9A8C;&#x6027;&#x9636;&#x6BB5;&#x3002;</p>
<h2 id="Btrfs-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#Btrfs-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="Btrfs &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>Btrfs &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2><p>btrfs &#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x53EB;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982; Better FS&#x3001;Butter FS &#x6216;&#x8005; B-Tree FS&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x4ECE;&#x5934;&#x5F00;&#x53D1;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;btrfs &#x51FA;&#x73B0;&#x7684;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x8D77;&#x521D;&#x5E0C;&#x671B;&#x6269;&#x5C55;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x4F7F;&#x5F97;&#x5B83;&#x5305;&#x62EC;&#x5FEB;&#x7167;&#x3001;&#x6C60;&#x5316;&#xFF08;pooling&#xFF09;&#x3001;&#x6821;&#x9A8C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x3002;&#x867D;&#x7136;&#x548C; ext4 &#x65E0;&#x5173;&#xFF0C;&#x5B83;&#x4E5F;&#x5E0C;&#x671B;&#x80FD;&#x4FDD;&#x7559; ext4 &#x4E2D;&#x80FD;&#x4F7F;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x4F01;&#x4E1A;&#x53D7;&#x76CA;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x6574;&#x5408;&#x989D;&#x5916;&#x7684;&#x80FD;&#x4F7F;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4F01;&#x4E1A;&#x53D7;&#x76CA;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x8BA9;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x76D8;&#x770B;&#x8D77;&#x6765;&#x4E00;&#x81F4;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x80FD;&#x4F7F;&#x4ED6;&#x4EEC;&#x53D7;&#x76CA;&#x5E76;&#x4E14;&#x4F7F;&#x6570;&#x636E;&#x6574;&#x5408;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;&#x5220;&#x9664;&#x91CD;&#x590D;&#x6570;&#x636E;&#x80FD;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x955C;&#x50CF;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x800C;&#x5DE8;&#x5927;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x65F6;&#x4F7F;&#x7528; btrfs &#x4E5F;&#x80FD;&#x4F7F;&#x6570;&#x636E;&#x955C;&#x50CF;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x7528;&#x6237;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x9009;&#x62E9;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x4ECE;&#x800C;&#x65E0;&#x9700;&#x955C;&#x50CF;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;btrfs &#x80FD;&#x6A2A;&#x8DE8;&#x591A;&#x79CD;&#x786C;&#x76D8;&#xFF0C;&#x548C; ext4 &#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x80FD;&#x652F;&#x6301; 16 &#x500D;&#x4EE5;&#x4E0A;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;btrfs &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x6700;&#x5927;&#x662F; 16 exbibytes&#xFF0C;&#x6700;&#x5927;&#x7684;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x4E5F;&#x662F; 16 exbibytes&#x3002;</p>
<h2 id="XFS-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#XFS-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="XFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>XFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2><p>XFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x6269;&#x5C55;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;extent file system&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x3002;XFS &#x662F; 64 &#x4F4D;&#x9AD8;&#x6027;&#x80FD;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9; XFS &#x7684;&#x652F;&#x6301;&#x5927;&#x6982;&#x5728; 2002 &#x5E74;&#x5408;&#x5E76;&#x5230;&#x4E86; Linux &#x5185;&#x6838;&#xFF0C;&#x5230;&#x4E86; 2009 &#x5E74;&#xFF0C;&#x7EA2;&#x5E3D;&#x4F01;&#x4E1A;&#x7248; Linux 5.4 &#x4E5F;&#x652F;&#x6301;&#x4E86; XFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9;&#x4E8E; 64 &#x4F4D;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;XFS &#x652F;&#x6301;&#x6700;&#x5927;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5927;&#x5C0F;&#x4E3A; 8 exbibytes&#x3002;XFS &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x9677;&#xFF0C;&#x4F8B;&#x5982;&#x5B83;&#x4E0D;&#x80FD;&#x538B;&#x7F29;&#xFF0C;&#x5220;&#x9664;&#x5927;&#x91CF;&#x6587;&#x4EF6;&#x65F6;&#x6027;&#x80FD;&#x4F4E;&#x4E0B;&#x3002;&#x76EE;&#x524D;RHEL 7.0 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528; XFS&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD8;&#x4E0D;&#x77E5;&#x9053; btrfs &#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x80FD;&#x5230;&#x6765;&#x3002;&#x5B98;&#x65B9;&#x8BF4;&#xFF0C;&#x5176;&#x4E0B;&#x4E00;&#x4EE3;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x88AB;&#x5F52;&#x7C7B;&#x4E3A;&#x201C;&#x4E0D;&#x7A33;&#x5B9A;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7528;&#x6237;&#x4E0B;&#x8F7D;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684; Ubuntu&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5B89;&#x88C5;&#x5230; btrfs &#x5206;&#x533A;&#x4E0A;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019; btrfs &#x4F1A;&#x88AB;&#x5F52;&#x7C7B;&#x5230; &#x201C;&#x7A33;&#x5B9A;&#x201D; &#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x8C1C;&#xFF0C; &#x76F4;&#x5230;&#x771F;&#x7684;&#x8BA4;&#x4E3A;&#x5B83;&#x201C;&#x7A33;&#x5B9A;&#x201D;&#x4E4B;&#x524D;&#xFF0C;&#x7528;&#x6237;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x671F;&#x671B; Ubuntu &#x4F1A;&#x9ED8;&#x8BA4;&#x91C7;&#x7528; btrfs&#x3002;&#x6709;&#x62A5;&#x9053;&#x8BF4; Fedora 18 &#x4F1A;&#x7528; btrfs &#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x9ED8;&#x8BA4;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x56E0;&#x4E3A;&#x5230;&#x4E86;&#x53D1;&#x5E03;&#x5B83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E94;&#x8BE5;&#x6709;&#x4E86; btrfs &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6821;&#x9A8C;&#x5668;&#x3002;&#x7531;&#x4E8E;&#x8FD8;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53E6;&#x5916;&#x548C; ext4 &#x76F8;&#x6BD4;&#x6027;&#x80FD;&#x4E0A;&#x4E5F;&#x6BD4;&#x8F83;&#x7F13;&#x6162;&#xFF0C;btrfs &#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x8981;&#x505A;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x7A76;&#x7ADF;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x66F4;&#x597D;&#x5462;&#xFF1F;&#x5C3D;&#x7BA1;&#x6027;&#x80FD;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF0C;&#x4F46; ext4 &#x8FD8;&#x662F;&#x8D62;&#x5BB6;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x5728;&#x4E8E;&#x6613;&#x7528;&#x6027;&#x4EE5;&#x53CA;&#x5E7F;&#x6CDB;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x684C;&#x9762;&#x6216;&#x8005;&#x5DE5;&#x4F5C;&#x7AD9;&#xFF0C; ext4 &#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x662F;&#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x4E0A;&#x9762;&#x5B89;&#x88C5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x540C;&#x65F6;&#xFF0C; ext4 &#x652F;&#x6301;&#x6700;&#x5927; 1 exabytes &#x7684;&#x5377;&#x548C; 16 terabytes &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x8003;&#x8651;&#x5230;&#x5927;&#x5C0F;&#xFF0C;&#x5B83;&#x4E5F;&#x8FD8;&#x6709;&#x5F88;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x7A7A;&#x95F4;&#x3002;</p>
<p>btrfs &#x80FD;&#x63D0;&#x4F9B;&#x66F4;&#x5927;&#x7684;&#x9AD8;&#x8FBE; 16 exabytes &#x7684;&#x5377;&#x4EE5;&#x53CA;&#x66F4;&#x597D;&#x7684;&#x5BB9;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x5B83;&#x611F;&#x89C9;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x9644;&#x52A0;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x5230; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5C3D;&#x7BA1; btrfs &#x652F;&#x6301;&#x4E0D;&#x540C;&#x7684;&#x53D1;&#x884C;&#x7248;&#xFF0C;&#x4F7F;&#x7528; btrfs &#x683C;&#x5F0F;&#x5316;&#x786C;&#x76D8;&#x4E4B;&#x524D;&#x5148;&#x8981;&#x6709; btrfs-tools &#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B89;&#x88C5; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x9879;&#xFF0C;&#x5373;&#x4FBF;&#x4E0D;&#x540C;&#x53D1;&#x884C;&#x7248;&#x4E4B;&#x95F4;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x8BC4;&#x4EF7;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9664;&#x4E86;&#x6587;&#x4EF6;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#x3002;btrfs &#x6709;&#x5F88;&#x591A;&#x597D;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x5199;&#x590D;&#x5236;&#xFF08;Copy-on-Write&#xFF09;&#x3001;&#x6269;&#x5C55;&#x6821;&#x9A8C;&#x3001;&#x5FEB;&#x7167;&#x3001;&#x6E05;&#x6D17;&#x3001;&#x81EA;&#x4FEE;&#x590D;&#x6570;&#x636E;&#x3001;&#x5197;&#x4F59;&#x5220;&#x9664;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x529F;&#x80FD;&#x3002;&#x548C; ZFS &#x76F8;&#x6BD4; btrfs &#x7F3A;&#x5C11; RAID-Z &#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E; btrfs&#xFF0C; RAID &#x8FD8;&#x5904;&#x4E8E;&#x5B9E;&#x9A8C;&#x6027;&#x9636;&#x6BB5;&#x3002;&#x5BF9;&#x4E8E;&#x5355;&#x7EAF;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x548C; ext4 &#x76F8;&#x6BD4; btrfs &#x4F3C;&#x4E4E;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#xFF0C;&#x4F46;&#x65F6;&#x95F4;&#x4F1A;&#x9A8C;&#x8BC1;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#xFF0C;&#x5BF9;&#x4E8E;&#x684C;&#x9762;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;ext4 &#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#x65F6;&#x4E5F;&#x6BD4; btrfs &#x66F4;&#x5FEB;&#x3002;btrfs &#x5F53;&#x7136;&#x503C;&#x5F97;&#x5C1D;&#x8BD5;&#x3001;&#x4F46;&#x8981;&#x5728;&#x684C;&#x9762; Linux &#x4E0A;&#x5B8C;&#x5168;&#x53D6;&#x4EE3; ext4 &#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x3002;&#x6570;&#x636E;&#x573A;&#x548C;&#x5927;&#x5B58;&#x50A8;&#x6C60;&#x4F1A;&#x63ED;&#x793A;&#x5173;&#x4E8E; ext4&#x3001;XCF &#x4EE5;&#x53CA; btrfs &#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x548C;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E0D;&#x540C;&#x6216;&#x8005;&#x5176;&#x5B83;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x8BC4;&#x8BBA;&#x6846;&#x4E2D;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5427;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    </div>

    

    

    <!-- Comments -->
    

</div>
        </section>

    </div>
</div>


</div>

<!-- Footer -->
<div class="push"></div>

<footer class="footer-content">
    <div class="container">
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-6 col-lg-6 footer-about">
                <h2>About</h2>
                <p>
                    Failure is never quite so frightening as regret.
                </p>
            </div>
            
    <div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 recent-posts">
        <h2>Recent Posts</h2>
        <ul>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/错误预算上线机制.html">错误预算上线机制</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/Moosefs概念总结.html">Moosefs概念总结</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/linux下编译安装Python环境与iPython.html">linux下编译安装Python环境与iPytho</a>
            </li>
            
            <li>
                <a class="footer-post" href="/uncategorized/2019/01/24/Linux下如何选择文件系统：EXT4、Btrfs-和-XFS.html">Linux下如何选择文件系统：EXT4、Btrfs</a>
            </li>
            
        </ul>
    </div>



            
<div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 footer-categories">
    <h2>Categories</h2>
    <ul>
        
        <li>
            <a class="footer-post" href="/categories/Linux/">Linux</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/Git/">Git</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/MySQL/">MySQL</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/AWS/">AWS</a>
        </li>
        
    </ul>
</div>

        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <ul class="list-inline footer-social-icons">
                    
                    <li class="list-inline-item">
                        <a href="https://github.com/wolf-7">
                            <span class="footer-icon-container">
                                <i class="fa fa-github"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    <li class="list-inline-item">
                        <a href="mailto:91unix@gmail.com">
                            <span class="footer-icon-container">
                                <i class="fa fa-envelope-o"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                </ul>
            </div>
        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <div class="footer-copyright">
                    © 2015-2019 | <a href="http://wolf7.org/">wolf7.org</a>
                </div>
            </div>
        </div>
    </div>
</footer>

<!-- After footer scripts -->

<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Tween Max -->
<script src="//cdnjs.cloudflare.com/ajax/libs/gsap/1.18.5/TweenMax.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Custom JavaScript -->
<script src="/js/main.js"></script>

<!-- Disqus Comments -->



</body>

</html>