<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!--Description-->
    
        <meta name="description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。">
    

    <!--Author-->
    
        <meta name="author" content="一匹来自北方的狼">
    

    <!--Open Graph Title-->
    
        <meta property="og:title" content="如何接受一个新业务的运维工作？"/>
    

    <!--Open Graph Description-->
    
        <meta property="og:description" content="雪藏风凌骨，&lt;br/&gt;空隐道玄心。&lt;br/&gt;寒窗问诸佛，&lt;br/&gt;飞渡红尘烬。" />
    

    <!--Open Graph Site Name-->
    <meta property="og:site_name" content="一匹来自北方的狼"/>

    <!--Type page-->
    
        <meta property="og:type" content="article" />
    

    <!--Page Cover-->
    

    <meta name="twitter:card" content="summary" />
    

    <!-- Title -->
    
    <title>如何接受一个新业务的运维工作？ - 一匹来自北方的狼</title>

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0-alpha.2/css/bootstrap.min.css" integrity="sha384-y3tfxAZXuh4HwSYylfB+J125MxIs6mR5FOHamPBG064zB+AFeWH94NdvaCBm8qnd" crossorigin="anonymous">

    <!-- Custom Fonts -->
    <link href="//maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet" type="text/css">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="//oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="//oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- Gallery -->
    <link href="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.css" type="text/css" rel="stylesheet" />

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/style.css">

    <!-- Google Analytics -->
    


</head>


<body>

<div class="bg-gradient"></div>
<div class="bg-pattern"></div>

<!-- Menu -->
<!--Menu Links and Overlay-->
<div class="menu-bg">
    <div class="menu-container">
        <ul>
            
            <li class="menu-item">
                <a href="/">
                    Home
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/archives">
                    Archives
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/categories">
                    Categories
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/tags">
                    Tags
                </a>
            </li>
            
            <li class="menu-item">
                <a href="/about">
                    About
                </a>
            </li>
            
        </ul>
    </div>
</div>

<!--Hamburger Icon-->
<nav>
    <a href="#menu"></a>
</nav>

<div class="container">

    <!-- Main Content -->
    <div class="row">
    <div class="col-sm-12">

        <!--Title and Logo-->
        <header>
    <div class="logo">
        <a href="/"><i class="logo-icon fa fa-cube" aria-hidden="true"></i></a>
        
    </div>
</header>

        <section class="main">
            
<div class="post">

    <div class="post-header">
        <h1 class="title">
            <a href="/职业规划/2016/05/02/如何接受一个新业务的运维工作.html">
                如何接受一个新业务的运维工作？
            </a>
        </h1>
        <div class="post-info">
            
                <span class="date">2016-05-02</span>
            
            
            
                <span class="category">
                    <a href="/categories/职业规划/">职业规划</a>
                </span>
            
        </div>
    </div>

    <div class="content">

        <!-- Gallery -->
        

        <!-- Post Content -->
        <hr>
<font color="" size="3"> &#x5BF9;&#x4E11;&#x8BDD;&#x8BF4;&#x524D;&#x5934;&#xFF1A;<br>&#x5148;&#x8DDF;&#x7814;&#x53D1;leader&#x6C9F;&#x901A;&#xFF0C;&#x704C;&#x8F93;&#x8FD0;&#x7EF4;&#x7406;&#x5FF5;&#xFF0C;&#x4E11;&#x8BDD;&#x8BF4;&#x5728;&#x524D;&#x5934;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x505A;&#x4FDD;&#x59C6;&#x5F0F;&#x8FD0;&#x7EF4;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x81F4;&#x529B;&#x4E8E;&#x7EBF;&#x4E0A;&#x670D;&#x52A1;&#x5B89;&#x5168;&#x3001;&#x7A33;&#x5B9A;&#x3001;&#x4F4E;&#x6210;&#x672C;&#x3001;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#xFF0C;&#x4ECE;&#x8FD0;&#x7EF4;&#x89C6;&#x89D2;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x529B;&#x3002;&#x5F00;&#x53D1;&#x673A;&#x3001;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF0C;&#x7814;&#x53D1;&#x81EA;&#x5DF1;&#x641E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x534F;&#x52A9;&#x5E2E;&#x5FD9;&#xFF0C;&#x505A;&#x4E13;&#x4E1A;&#x7684;&#x54A8;&#x8BE2;&#x670D;&#x52A1;&#xFF0C;&#x60F3;&#x8BA9;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x64CD;&#x5200;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x66F4;&#xFF0C;&#x514D;&#x8C08;&#xFF01;</font>

<hr>
<a id="more"></a>
<h3 id="&#x4E1A;&#x52A1;&#x6982;&#x8981;&#x4E86;&#x89E3;"><a href="#&#x4E1A;&#x52A1;&#x6982;&#x8981;&#x4E86;&#x89E3;" class="headerlink" title="&#x4E1A;&#x52A1;&#x6982;&#x8981;&#x4E86;&#x89E3;"></a>&#x4E1A;&#x52A1;&#x6982;&#x8981;&#x4E86;&#x89E3;</h3><p>&#x4E86;&#x89E3;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x7814;&#x53D1;&#x540C;&#x5B66;&#x3001;&#x7814;&#x53D1;leader&#x3001;&#x6D4B;&#x8BD5;&#x540C;&#x5B66;&#x3001;&#x6D4B;&#x8BD5;leader&#x3001;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5206;&#x522B;&#x662F;&#x8C01;&#xFF0C;&#x8054;&#x7CFB;&#x65B9;&#x5F0F;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x62C9;&#x4E2A;&#x7FA4;&#xFF0C;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x670D;&#x52A1;&#x662F;&#x5E72;&#x5565;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4E1A;&#x754C;&#x6709;&#x5BF9;&#x6807;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x5417;&#xFF0C;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x5FEB;&#x901F;&#x8BA4;&#x8BC6;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x670D;&#x52A1;&#x7684;&#x4E0A;&#x4E0B;&#x6E38;&#xFF0C;&#x4F9D;&#x8D56;&#x54EA;&#x4E9B;&#x670D;&#x52A1;&#xFF0C;&#x54EA;&#x4E9B;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x6211;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x63A5;&#x53E3;&#x4EBA;&#x662F;&#x8C01;&#xFF0C;&#x8FD9;&#x91CC;&#x5148;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x60C5;&#x51B5;&#xFF0C;&#x90E8;&#x7F72;&#x5728;&#x54EA;&#x4E9B;&#x673A;&#x623F;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x57FA;&#x7840;&#x7F51;&#x7EDC;&#x3001;&#x4E13;&#x7EBF;&#x5E26;&#x5BBD;&#x3001;&#x673A;&#x623F;&#x51FA;&#x53E3;&#x662F;&#x5426;&#x9760;&#x8C31;&#xFF0C;&#x662F;&#x5426;&#x66FE;&#x56E0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5BFC;&#x81F4;&#x8FC7;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x524D;&#x4E3B;&#x8981;&#x75DB;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<h3 id="&#x4E1A;&#x52A1;&#x4E32;&#x8BB2;"><a href="#&#x4E1A;&#x52A1;&#x4E32;&#x8BB2;" class="headerlink" title="&#x4E1A;&#x52A1;&#x4E32;&#x8BB2;"></a>&#x4E1A;&#x52A1;&#x4E32;&#x8BB2;</h3><p>&#x8981;&#x6C42;&#x7814;&#x53D1;&#x540C;&#x5B66;&#xFF08;&#x6216;&#x8005;&#x4E0A;&#x4E00;&#x4EFB;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#xFF09;&#x51C6;&#x5907;PPT&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x4E32;&#x8BB2;&#xFF0C;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x7814;&#x53D1;&#x540C;&#x5B66;&#x5E0C;&#x671B;&#x4F20;&#x8FBE;&#x7ED9;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x5E0C;&#x671B;&#x4ECE;&#x7814;&#x53D1;&#x8FD9;&#x5F97;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x8BE6;&#x7EC6;&#x90E8;&#x7F72;&#x62D3;&#x6251;&#x3001;&#x670D;&#x52A1;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x3001;&#x6570;&#x636E;&#x6D41;&#x3001;&#x63D0;&#x6D4B;&#x53D8;&#x66F4;&#x6D41;&#x7A0B;&#x3001;&#x76D1;&#x63A7;&#x65B9;&#x5F0F;&#x3001;&#x90E8;&#x7F72;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x673A;&#x5668;&#x3001;&#x673A;&#x5668;&#x767B;&#x5F55;&#x65B9;&#x5F0F;&#x3001;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x662F;&#x4EC0;&#x4E48;&#x6A21;&#x5757;&#x3001;OS&#x53C2;&#x6570;&#x662F;&#x5426;&#x6709;&#x8C03;&#x4F18;&#xFF0C;&#x8003;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#x3001;&#x7528;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#xFF0C;&#x8003;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6BD4;&#x5982;&#x4E3A;&#x5565;&#x7528;&#x4E86;tomcat&#x800C;&#x4E0D;&#x662F;resin&#x3001;&#x76F8;&#x5173;wiki&#x3001;&#x6545;&#x969C;&#x5904;&#x7406;&#x9884;&#x6848;&#x3001;&#x5E38;&#x89C1;&#x6545;&#x969C;&#x3001;&#x5F53;&#x524D;&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x2026;&#x2026;&#x7B49;&#x7B49;</p>
<p>&#x5982;&#x679C;&#x4E1A;&#x52A1;&#x6709;&#x5355;&#x70B9;&#xFF0C;&#x4E0D;&#x63A5;&#xFF0C;&#x8BA9;&#x7814;&#x53D1;&#x6539;&#x9020;&#x3002;&#x5982;&#x679C;&#x8FD0;&#x7EF4;&#x7684;&#x8001;&#x677F;&#x7684;&#x8001;&#x677F;&#x5F3A;&#x5236;&#x8981;&#x6C42;&#xFF0C;&#x4E11;&#x8BDD;&#x8BF4;&#x524D;&#x5934;&#xFF1A;&#x56E0;&#x5355;&#x70B9;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD0;&#x7EF4;&#x4E0D;&#x80CC;&#x9505;&#x3002;</p>
<h3 id="&#x8D44;&#x4EA7;&#x68B3;&#x7406;"><a href="#&#x8D44;&#x4EA7;&#x68B3;&#x7406;" class="headerlink" title="&#x8D44;&#x4EA7;&#x68B3;&#x7406;"></a>&#x8D44;&#x4EA7;&#x68B3;&#x7406;</h3><p>&#x6B63;&#x5F0F;&#x51C6;&#x5907;&#x63A5;&#x624B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x68B3;&#x7406;&#x8D44;&#x4EA7;&#x3002;&#x6BD4;&#x5982;&#x7528;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x57DF;&#x540D;&#xFF0C;&#x8FD9;&#x4E9B;&#x57DF;&#x540D;&#x5BF9;&#x5E94;&#x54EA;&#x4E9B;&#x4E1A;&#x52A1;&#x3001;&#x54EA;&#x4E9B;&#x865A;IP&#xFF0C;&#x5206;&#x522B;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4EC0;&#x4E48;&#x670D;&#x52A1;&#x3001;&#x54EA;&#x4E9B;&#x673A;&#x5668;&#xFF0C;&#x5206;&#x522B;&#x90E8;&#x7F72;&#x4E86;&#x4EC0;&#x4E48;&#x6A21;&#x5757;&#x3001;&#x4E1A;&#x52A1;&#x5728;&#x54EA;&#x4E9B;&#x673A;&#x623F;&#x3001;&#x7528;&#x4E86;&#x591A;&#x5C11;&#x5E26;&#x5BBD;&#x3001;&#x603B;&#x5E26;&#x5BBD;&#x60C5;&#x51B5;&#x3001;&#x662F;&#x5426;&#x6709;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x5171;&#x7528;&#x4E89;&#x62A2;&#x3002;</p>
<p>&#x673A;&#x5668;&#x9700;&#x8981;&#x62FF;&#x5230;&#x66F4;&#x8BE6;&#x5C3D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x673A;&#x5668;&#x914D;&#x7F6E;&#x3001;&#x673A;&#x67B6;&#x4F4D;&#x3001;IP&#x3001;&#x7BA1;&#x7406;&#x5361;IP&#x7B49;&#x7B49;&#xFF0C;&#x516C;&#x53F8;&#x5E94;&#x8BE5;&#x6709;&#x4E2A;CMDB&#x4F9B;&#x67E5;&#x8BE2;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x6784;&#x5EFA;&#x8FD9;&#x4E2A;CMDB&#x3002;</p>
<p>&#x540E;&#x9762;&#x8981;&#x8003;&#x8651;&#x673A;&#x5668;&#x662F;&#x5426;&#x9700;&#x8981;&#x6709;&#x5907;&#x673A;&#x3001;&#x5907;&#x4EF6;&#xFF0C;&#x673A;&#x578B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7EDF;&#x4E00;&#x3002;</p>
<h3 id="&#x57FA;&#x7840;&#x76D1;&#x63A7;"><a href="#&#x57FA;&#x7840;&#x76D1;&#x63A7;" class="headerlink" title="&#x57FA;&#x7840;&#x76D1;&#x63A7;"></a>&#x57FA;&#x7840;&#x76D1;&#x63A7;</h3><p>&#x77E5;&#x9053;&#x6709;&#x54EA;&#x4E9B;&#x8D44;&#x4EA7;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x8D44;&#x4EA7;&#x505A;&#x76D1;&#x63A7;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x57DF;&#x540D;&#x8FDE;&#x901A;&#x6027;&#x76D1;&#x63A7;/&#x5EF6;&#x8FDF;&#x76D1;&#x63A7;&#x3001;&#x865A;IP&#x7684;&#x8FDE;&#x901A;&#x6027;&#x76D1;&#x63A7;/&#x5EF6;&#x8FDF;&#x76D1;&#x63A7;&#x3001;&#x673A;&#x5668;&#x5B95;&#x673A;&#x76D1;&#x63A7;&#x3001;&#x673A;&#x5668;&#x786C;&#x4EF6;&#x76D1;&#x63A7;&#x3001;sshd/crond&#x7B49;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;&#x76D1;&#x63A7;&#x3001;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x603B;&#x6570;&#x76D1;&#x63A7;&#x3001;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#x76D1;&#x63A7;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x770B;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x300A;&#x5B8C;&#x5907;&#x7684;&#x76D1;&#x63A7;&#x5E94;&#x8986;&#x76D6;&#x4EC0;&#x4E48;&#x300B;</p>
<h3 id="&#x670D;&#x52A1;&#x68B3;&#x7406;"><a href="#&#x670D;&#x52A1;&#x68B3;&#x7406;" class="headerlink" title="&#x670D;&#x52A1;&#x68B3;&#x7406;"></a>&#x670D;&#x52A1;&#x68B3;&#x7406;</h3><p>&#x5403;&#x900F;&#x4E4B;&#x524D;&#x4E32;&#x8BB2;&#x65F6;&#x7ED9;&#x7684;&#x67B6;&#x6784;&#x56FE;&#x3001;&#x6570;&#x636E;&#x6D41;&#x56FE;&#x3001;&#x90E8;&#x7F72;&#x62D3;&#x6251;&#x56FE;&#x3002;&#x4ECE;&#x8FD0;&#x7EF4;&#x5C42;&#x9762;&#xFF0C;&#x6700;&#x597D;&#x8FD8;&#x8981;&#x77E5;&#x9053;&#x516C;&#x53F8;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#x56FE;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90E8;&#x7F72;&#x5728;&#x54EA;&#x4E9B;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x90E8;&#x7F72;&#x5728;&#x54EA;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x8D26;&#x53F7;&#x542F;&#x52A8;&#x7684;&#xFF0C;&#x65E5;&#x5FD7;&#x6253;&#x5230;&#x54EA;&#x91CC;&#x4E86;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x4E0A;&#x7EBF;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x5403;CPU&#x8D44;&#x6E90;&#x8FD8;&#x662F;&#x5185;&#x5B58;&#x8FD8;&#x662F;&#x78C1;&#x76D8;&#x8FD8;&#x662F;IO&#xFF0C;&#x9700;&#x8981;&#x9884;&#x7559;&#x591A;&#x5C11;&#x8D44;&#x6E90;&#xFF0C;&#x5E73;&#x65F6;&#x5229;&#x7528;&#x7387;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x5E94;&#x8BE5;&#x914D;&#x7F6E;&#x591A;&#x5927;&#x7684;&#x9608;&#x503C;&#x505A;&#x76D1;&#x63A7;&#xFF0C;&#x662F;&#x5426;&#x9700;&#x8981;watchdog&#x81EA;&#x52A8;&#x62C9;&#x8D77;&#xFF0C;&#x65E5;&#x5FD7;&#x91CC;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x5173;&#x952E;&#x5B57;&#x9700;&#x8981;&#x62A5;&#x8B66;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x4E1A;&#x52A1;&#x76D1;&#x63A7;"><a href="#&#x4E1A;&#x52A1;&#x76D1;&#x63A7;" class="headerlink" title="&#x4E1A;&#x52A1;&#x76D1;&#x63A7;"></a>&#x4E1A;&#x52A1;&#x76D1;&#x63A7;</h3><p>&#x57FA;&#x672C;&#x7684;&#x8FDB;&#x7A0B;&#x3001;&#x7AEF;&#x53E3;&#x5B58;&#x6D3B;&#x6027;&#x76D1;&#x63A7;&#xFF0C;&#x673A;&#x5668;&#x5229;&#x7528;&#x7387;&#x76D1;&#x63A7;&#x3001;&#x65E5;&#x5FD7;&#x5173;&#x952E;&#x5B57;&#x76D1;&#x63A7;&#x3001;&#x65E5;&#x5FD7;&#x4E0D;&#x6EDA;&#x52A8;&#x76D1;&#x63A7;&#x3001;&#x5173;&#x8054;&#x7684;&#x670D;&#x52A1;&#x7684;&#x76D1;&#x63A7;&#x7B49;&#x7B49;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x505A;API&#x7C92;&#x5EA6;&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x6765;&#x63A8;&#x52A8;&#x4E1A;&#x52A1;&#x4F18;&#x5316;&#x3002;</p>
<h3 id="&#x6807;&#x51C6;&#x5316;&#x6539;&#x9020;"><a href="#&#x6807;&#x51C6;&#x5316;&#x6539;&#x9020;" class="headerlink" title="&#x6807;&#x51C6;&#x5316;&#x6539;&#x9020;"></a>&#x6807;&#x51C6;&#x5316;&#x6539;&#x9020;</h3><p>&#x673A;&#x5668;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53D1;&#x884C;&#x7248;&#x3001;OS&#x7248;&#x672C;&#x3001;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;jdk&#x3001;tomcat&#x3001;nginx&#xFF0C;&#x90FD;&#x8981;&#x7EDF;&#x4E00;&#xFF0C;&#x505A;&#x6807;&#x51C6;&#x5316;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x6269;&#x5BB9;&#x3001;&#x53D8;&#x66F4;&#x3001;&#x4E0B;&#x7EBF;&#x505A;&#x4E00;&#x952E;&#x5316;&#xFF0C;&#x6BCF;&#x6B21;&#x5347;&#x7EA7;&#x53EA;&#x9700;&#x8981;&#x7ED9;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#x5373;&#x53EF;&#xFF0C;&#x6B64;&#x65F6;&#x7814;&#x53D1;&#x64CD;&#x4F5C;&#x8FD8;&#x662F;&#x8FD0;&#x7EF4;&#x64CD;&#x4F5C;&#x6548;&#x679C;&#x4E00;&#x6837;&#xFF0C;&#x6545;&#x800C;&#x53EF;&#x4EE5;&#x4EA4;&#x7ED9;&#x7814;&#x53D1;&#x4E0A;&#x7EBF;&#xFF0C;&#x91CA;&#x653E;&#x8FD0;&#x7EF4;&#x4EBA;&#x529B;&#xFF0C;&#x6743;&#x9650;&#x8981;&#x63A7;&#x5236;&#x597D;&#x3002;</p>
<p>&#x91CD;&#x590D;&#x7684;&#x5E38;&#x89C4;&#x64CD;&#x4F5C;&#x4E5F;&#x8981;&#x56FA;&#x5316;&#x6210;&#x811A;&#x672C;&#xFF0C;&#x4E00;&#x952E;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x68B3;&#x7406;&#x6545;&#x969C;&#x81EA;&#x6108;&#x573A;&#x666F;&#xFF0C;&#x770B;&#x5E73;&#x65F6;&#x6709;&#x54EA;&#x4E9B;&#x6545;&#x969C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x62BD;&#x8C61;&#x4E3A;&#x811A;&#x672C;&#xFF0C;&#x62A5;&#x8B66;&#x4E4B;&#x540E;&#x81EA;&#x52A8;&#x89E6;&#x53D1;&#xFF0C;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x5904;&#x7406;&#x3002;</p>
<p>&#x516C;&#x53F8;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x6BD4;&#x5982;&#x540D;&#x5B57;&#x670D;&#x52A1;&#x3001;MQ&#x3001;&#x65E5;&#x5FD7;&#x5E73;&#x53F0;&#xFF0C;&#x63A8;&#x52A8;&#x7814;&#x53D1;&#x6539;&#x9020;&#xFF0C;&#x5C06;&#x65B0;&#x670D;&#x52A1;&#x63A5;&#x5165;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x8FD8;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD0;&#x7EF4;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x53EF;&#x4EE5;&#x7740;&#x624B;&#x641E;&#x8D77;&#x3002;</p>
<h3 id="SOP&#x68B3;&#x7406;"><a href="#SOP&#x68B3;&#x7406;" class="headerlink" title="SOP&#x68B3;&#x7406;"></a>SOP&#x68B3;&#x7406;</h3><p>&#x6545;&#x969C;&#x9884;&#x6848;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7EBF;&#x4E0A;&#x6CA1;&#x51FA;&#x6545;&#x969C;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x63D0;&#x524D;&#x53BB;&#x60F3;&#xFF0C;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x4EC0;&#x4E48;&#x6545;&#x969C;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x51FA;&#x4E86;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF0C;&#x628A;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x63D0;&#x524D;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x7EBF;&#x4E0A;&#x51FA;&#x6545;&#x969C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x90FD;&#x6BD4;&#x8F83;&#x7D27;&#x5F20;&#xFF0C;&#x76F4;&#x63A5;&#x770B;&#x7740;&#x9884;&#x6848;&#x5904;&#x7406;&#xFF0C;&#x5C31;&#x8E0F;&#x5B9E;&#x4E0D;&#x5C11;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;</p>
<h3 id="&#x6545;&#x969C;&#x6F14;&#x7EC3;"><a href="#&#x6545;&#x969C;&#x6F14;&#x7EC3;" class="headerlink" title="&#x6545;&#x969C;&#x6F14;&#x7EC3;"></a>&#x6545;&#x969C;&#x6F14;&#x7EC3;</h3><p>&#x5149;&#x6709;&#x9884;&#x6848;&#x6CA1;&#x6709;&#x6F14;&#x7EC3;&#xFF0C;&#x662F;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x9884;&#x6848;&#x662F;&#x4E0D;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x641E;&#x4E2A;&#x653E;&#x706B;&#x6F14;&#x4E60;&#xFF0C;&#x628A;&#x6A21;&#x5757;&#x641E;&#x6302;&#x8BD5;&#x4E00;&#x628A;&#xFF0C;&#x628A;&#x673A;&#x5668;&#x641E;&#x6302;&#x8BD5;&#x4E00;&#x628A;&#xFF0C;&#x5BF9;&#x7EBF;&#x4E0A;&#x7A33;&#x5B9A;&#x6027;&#x7EDD;&#x5BF9;&#x4F1A;&#x6709;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x7279;&#x522B;&#x662F;&#x7814;&#x53D1;&#x8BF4;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x6302;&#x6389;&#xFF0C;&#x53EF;&#x7528;&#x6027;&#x80AF;&#x5B9A;&#x6CA1;&#x5F71;&#x54CD;&#xFF0C;OK&#xFF0C;&#x641E;&#x6302;&#x8BD5;&#x8BD5;&#x5148;&#x3002;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6253;&#x4ED6;&#x8138;&#xFF0C;-_-||</p>
<p>&#x6709;&#x4E9B;&#x573A;&#x666F;&#x6F14;&#x7EC3;&#x662F;&#x4F1A;&#x6709;&#x635F;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x8FD8;&#x8981;&#x4E0D;&#x8981;&#x6F14;&#x7EC3;&#xFF1F;&#x8FD9;&#x4E2A;&#x9700;&#x8981;case by case&#x7684;&#x770B;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x90FD;&#x662F;&#x8981;&#x505A;&#x6F14;&#x7EC3;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x6BD5;&#x7ADF;&#xFF0C;&#x4EBA;&#x5728;&#x8FD9;&#x76EF;&#x7740;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x665A;&#x4E0A;&#x7761;&#x7740;&#x4E86;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x8981;&#x5F3A;&#x592A;&#x591A;&#x3002;&#x5F53;&#x7136;&#xFF0C; &#x5927;&#x89C4;&#x6A21;&#x57FA;&#x7840;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x8FD9;&#x79CD;&#x6F14;&#x7EC3;&#xFF0C;&#x8FD8;&#x662F;&#x7B97;&#x4E86;&#x5427;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x4E1A;&#x52A1;&#x90FD;&#x662F;&#x4E0D;&#x5177;&#x5907;&#x673A;&#x623F;&#x7EA7;&#x5BB9;&#x707E;&#x7684;&#xFF0C;&#x5475;&#x5475;</p>
<p>&#x4E0A;&#x9762;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x5DE5;&#x4F5C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x4E0A;&#x9762;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x7684;&#xFF0C;&#x90A3;&#x672A;&#x6765;&#x7684;&#x5927;&#x628A;&#x65F6;&#x95F4;&#x8FD0;&#x7EF4;&#x505A;&#x5565;&#xFF1F;</p>
<p>&#x9664;&#x4E86;&#x518D;&#x82B1;&#x8D39;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x505A;&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x628A;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x6765;&#x63D0;&#x5347;&#x4E1A;&#x52A1;&#x4EA7;&#x54C1;&#x529B;&#x3002;&#x505A;&#x7CBE;&#x7EC6;&#x5316;&#x8FD0;&#x7EF4;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x8FD0;&#x7EF4;&#x4E5D;&#x5B57;&#x771F;&#x8A00;&#x4E48;&#xFF1F;&#x201C;&#x5B89;&#x5168;&#x7A33;&#x5B9A;&#x9AD8;&#x6548;&#x4F4E;&#x6210;&#x672C;&#x201D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5411;&#x3002;&#x4E0B;&#x9762;&#x4E3E;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<h3 id="&#x518D;&#x8C08;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;"><a href="#&#x518D;&#x8C08;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;" class="headerlink" title="&#x518D;&#x8C08;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;"></a>&#x518D;&#x8C08;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;</h3><p>&#x4E0A;&#x9762;&#x8C08;&#x5230;&#x8FC7;&#x4E00;&#x6B21;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x76D1;&#x63A7;&#x6307;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x4EA7;&#x54C1;&#x4E86;&#x89E3;&#x8DB3;&#x591F;&#x4E4B;&#x540E;&#xFF0C;&#x5E94;&#x8BE5;&#x505A;&#x4E00;&#x4E9B;&#x4E1A;&#x52A1;&#x7279;&#x6709;&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x63A8;&#x52A8;&#x7814;&#x53D1;&#x53BB;&#x505A;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x8FBE;&#x5230;&#x6548;&#x679C;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x4F60;&#x8FD0;&#x7EF4;&#x4E86;&#x4E00;&#x4E2A;MQ&#xFF0C;&#x6D88;&#x606F;&#x5806;&#x79EF;&#x91CF;&#x662F;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x6EF4;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x8FD0;&#x7EF4;&#x4E86;&#x4E00;&#x4E2A;RPC&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x63A5;&#x53E3;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x957F;&#x3001;&#x6210;&#x529F;&#x7387;&#x662F;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x6EF4;&#xFF1B;&#x6BD4;&#x5982;&#x4F60;&#x8FD0;&#x7EF4;&#x4E86;&#x4E00;&#x4E2A;S3&#x670D;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x6876;&#x7684;&#x77ED;&#x671F;&#x5E26;&#x5BBD;&#x589E;&#x91CF;&#x4F60;&#x662F;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x6EF4;&#xFF1B;&#x6709;&#x90A3;&#x4E48;&#x70B9;&#x611F;&#x89C9;&#x4E86;&#x4E48;&#xFF1F; :)</p>
<h3 id="API&#x6210;&#x529F;&#x7387;&#x3001;&#x5EF6;&#x8FDF;&#x7EDF;&#x8BA1;"><a href="#API&#x6210;&#x529F;&#x7387;&#x3001;&#x5EF6;&#x8FDF;&#x7EDF;&#x8BA1;" class="headerlink" title="API&#x6210;&#x529F;&#x7387;&#x3001;&#x5EF6;&#x8FDF;&#x7EDF;&#x8BA1;"></a>API&#x6210;&#x529F;&#x7387;&#x3001;&#x5EF6;&#x8FDF;&#x7EDF;&#x8BA1;</h3><p>&#x5728;&#x6D41;&#x91CF;&#x5165;&#x53E3;&#x7684;nginx&#x505A;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x7EBF;&#x7684;&#x6240;&#x6709;API&#x7684;&#x6210;&#x529F;&#x7387;&#x548C;&#x5EF6;&#x8FDF;&#x7EDF;&#x8BA1;&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x628A;&#x6210;&#x529F;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;&#x7684;TopN&#x627E;&#x51FA;&#x6765;&#xFF0C;&#x628A;&#x5EF6;&#x8FDF;&#x6BD4;&#x8F83;&#x5927;&#x7684;TopN&#x627E;&#x51FA;&#x6765;&#xFF0C;&#x8BA9;&#x4E1A;&#x52A1;&#x53BB;&#x4F18;&#x5316;&#x3002;&#x8001;&#x677F;&#x4F1A;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x7684;&#x3002;</p>
<h3 id="&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x68B3;&#x7406;"><a href="#&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x68B3;&#x7406;" class="headerlink" title="&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x68B3;&#x7406;"></a>&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x68B3;&#x7406;</h3><p>&#x6574;&#x7406;&#x7EBF;&#x4E0A;&#x6240;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6328;&#x4E2A;&#x89E3;&#x51B3;&#xFF0C;&#x8FD0;&#x7EF4;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x7684;&#x8FD0;&#x7EF4;&#x641E;&#x5B9A;&#xFF0C;&#x8FD0;&#x7EF4;&#x641E;&#x4E0D;&#x5B9A;&#x7684;&#x627E;&#x7814;&#x53D1;&#x8981;&#x6392;&#x671F;&#xFF0C;&#x6BCF;&#x5468;&#x89E3;&#x51B3;&#x4E86;&#x591A;&#x5C11;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x95EE;&#x9898;&#x5F85;&#x89E3;&#x51B3;&#xFF0C;&#x7528;&#x5468;&#x62A5;&#x7684;&#x65B9;&#x5F0F;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x3002;</p>
<h3 id="&#x6210;&#x672C;&#x4F18;&#x5316;"><a href="#&#x6210;&#x672C;&#x4F18;&#x5316;" class="headerlink" title="&#x6210;&#x672C;&#x4F18;&#x5316;"></a>&#x6210;&#x672C;&#x4F18;&#x5316;</h3><p>&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x6DF7;&#x90E8;&#x3001;&#x6216;&#x8005;&#x7EDF;&#x4E00;&#x7684;&#x8D44;&#x6E90;&#x8C03;&#x5EA6;&#x5E73;&#x53F0;&#x6765;&#x8282;&#x7701;&#x673A;&#x5668;&#x8D44;&#x6E90;&#xFF0C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4FBF;&#x5B9C;&#x7684;&#x4E5F;&#x597D;&#x51E0;&#x4E07;&#x5462;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x662F;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x6709;&#x4EA7;&#x51FA;&#x7684;&#x3002;</p>
<h3 id="&#x5BB9;&#x91CF;&#x89C4;&#x5212;"><a href="#&#x5BB9;&#x91CF;&#x89C4;&#x5212;" class="headerlink" title="&#x5BB9;&#x91CF;&#x89C4;&#x5212;"></a>&#x5BB9;&#x91CF;&#x89C4;&#x5212;</h3><p>&#x5BB9;&#x91CF;&#x89C4;&#x5212;&#x548C;&#x6210;&#x672C;&#x4F18;&#x5316;&#x5B9E;&#x9645;&#x662F;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5BB9;&#x91CF;&#x89C4;&#x5212;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x6839;&#x636E;&#x81EA;&#x7136;&#x589E;&#x91CF;&#x548C;&#x8FD0;&#x8425;&#x9700;&#x6C42;&#xFF0C;&#x63D0;&#x524D;&#x89C4;&#x5212;&#x51C6;&#x5907;&#x76F8;&#x5E94;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x5BB9;&#x91CF;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x5E26;&#x5BBD;&#x3001;&#x4E13;&#x7EBF;&#x3001;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x3001;&#x673A;&#x5668;&#x7B49;&#x7B49;&#xFF1B;&#x5F53;&#x4E1A;&#x52A1;&#x91CF;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x817E;&#x632A;&#x76F8;&#x5173;&#x8D44;&#x6E90;&#x652F;&#x6301;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x7EBF;&#xFF0C;&#x8BA9;&#x8FD9;&#x4E9B;&#x786C;&#x4EF6;&#x5C3D;&#x91CF;&#x6EE1;&#x8D1F;&#x8377;&#x8FD0;&#x8F6C;&#xFF0C;&#x7269;&#x6709;&#x6240;&#x503C;&#x3002;</p>
<p>&#x4E1A;&#x52A1;&#x7CBE;&#x7EC6;&#x5316;&#x8FD0;&#x7EF4;&#x53EF;&#x4EE5;&#x60F3;&#x51FA;&#x5404;&#x79CD;&#x4E8B;&#x60C5;&#x6765;&#x641E;&#xFF0C;&#x9664;&#x4E86;&#x505A;&#x8FD9;&#x4E8B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x957F;&#x671F;&#x6295;&#x5165;&#x7684;&#x662F;&#x6784;&#x5EFA;&#x8FD0;&#x7EF4;&#x57FA;&#x7840;&#x5E73;&#x53F0;&#xFF0C;&#x50CF;&#x4EC0;&#x4E48;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x3001;&#x90E8;&#x7F72;&#x7CFB;&#x7EDF;&#x3001;&#x4EA7;&#x54C1;&#x5E93;&#x3001;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x5E73;&#x53F0;&#x3001;&#x57DF;&#x540D;&#x7BA1;&#x7406;&#x3001;&#x56DB;&#x4E03;&#x5C42;&#x63A5;&#x5165;&#x914D;&#x7F6E;&#x5E73;&#x53F0;&#x3001;&#x65E5;&#x5FD7;&#x5E73;&#x53F0;&#x3001;Trace&#x7CFB;&#x7EDF;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#xFF0C;&#x55EF;&#xFF0C;&#x5176;&#x5B9E;&#x8FD0;&#x7EF4;&#x8FD8;&#x662F;&#x633A;&#x5FD9;&#x7684;&#x3002;</p>
<h3 id="&#x5173;&#x4E8E;&#x6C9F;&#x901A;"><a href="#&#x5173;&#x4E8E;&#x6C9F;&#x901A;" class="headerlink" title="&#x5173;&#x4E8E;&#x6C9F;&#x901A;"></a>&#x5173;&#x4E8E;&#x6C9F;&#x901A;</h3><p>&#x6700;&#x540E;&#x8BF4;&#x4E00;&#x70B9;&#xFF0C;&#x63A5;&#x624B;&#x4E00;&#x4E2A;&#x65B0;&#x4E1A;&#x52A1;&#x8FD0;&#x7EF4;&#xFF0C;&#x52BF;&#x5FC5;&#x4E0E;&#x7814;&#x53D1;&#x6709;&#x5404;&#x79CD;&#x6C9F;&#x901A;&#xFF0C;&#x6BCF;&#x6B21;&#x6C9F;&#x901A;&#x90FD;&#x8981;&#x5199;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#xFF0C;&#x53D1;&#x90AE;&#x4EF6;&#x51FA;&#x6765;&#xFF0C;&#x8DDF;&#x8FDB;&#x4EBA;&#x662F;&#x8C01;&#xFF0C;&#x65F6;&#x95F4;&#x70B9;&#x662F;&#x5565;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x5199;&#x660E;&#x767D;&#xFF0C;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x53CC;&#x65B9;&#x56E2;&#x961F;&#x90AE;&#x4EF6;&#x7EC4;&#xFF0C;cc&#x5404;&#x65B9;&#x8001;&#x5927;&#x3002;&#x4E8B;&#x540E;&#x5173;&#x952E;&#x8282;&#x70B9;&#x505A;check&#xFF0C;&#x5982;&#x672A;&#x5B8C;&#x6210;&#xFF0C;&#x7EBF;&#x4E0B;&#x6C9F;&#x901A;&#xFF0C;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x540E;&#x8FFD;&#x6B64;&#x90AE;&#x4EF6;&#x7ED9;&#x7ED3;&#x8BBA;&#xFF0C;&#x8BF4;&#x660E;&#x5EF6;&#x671F;&#x539F;&#x56E0;&#x4EE5;&#x53CA;&#x65B0;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x3002;&#x5982;&#x679C;&#x6C9F;&#x901A;&#x4E0D;&#x7545;&#xFF0C;&#x8BA9;&#x8001;&#x5927;&#x53BB;&#x534F;&#x8C03;&#x3002;</p>
<p><img src="/images/sh7.jpg" width="100%" height="80%"></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    </div>

    

    
        <div class="post-tags">
            <i class="fa fa-tags" aria-hidden="true"></i>
            <a href="/tags/职业规划/">#职业规划</a>
        </div>
    

    <!-- Comments -->
    

</div>
        </section>

    </div>
</div>


</div>

<!-- Footer -->
<div class="push"></div>

<footer class="footer-content">
    <div class="container">
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-6 col-lg-6 footer-about">
                <h2>About</h2>
                <p>
                    Failure is never quite so frightening as regret.
                </p>
            </div>
            
    <div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 recent-posts">
        <h2>Recent Posts</h2>
        <ul>
            
            <li>
                <a class="footer-post" href="/AWS/2018/05/29/搭建grafana-on-AWS-Ubuntu-Instance.html">Install And Configure Gra</a>
            </li>
            
            <li>
                <a class="footer-post" href="/AWS/2018/02/06/配置适用于Lambda函数的AWS环境NAT网关-从VPC访问Intelnet公共网络.html">配置适用于Lambda函数的AWS环境NAT网关-</a>
            </li>
            
            <li>
                <a class="footer-post" href="/职业规划/2018/01/01/做一个职业运维人.html">做一个职业运维人</a>
            </li>
            
            <li>
                <a class="footer-post" href="/职业规划/2017/07/17/运维的价值与目标拆解.html">运维的价值与目标拆解</a>
            </li>
            
        </ul>
    </div>



            
<div class="col-xs-6 col-sm-6 col-md-3 col-lg-3 footer-categories">
    <h2>Categories</h2>
    <ul>
        
        <li>
            <a class="footer-post" href="/categories/Linux/">Linux</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/Git/">Git</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/MySQL/">MySQL</a>
        </li>
        
        <li>
            <a class="footer-post" href="/categories/AWS/">AWS</a>
        </li>
        
    </ul>
</div>

        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <ul class="list-inline footer-social-icons">
                    
                    <li class="list-inline-item">
                        <a href="https://github.com/wolf-7">
                            <span class="footer-icon-container">
                                <i class="fa fa-github"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                    
                    
                    
                    
                    
                    
                    
                    <li class="list-inline-item">
                        <a href="mailto:91unix@gmail.com">
                            <span class="footer-icon-container">
                                <i class="fa fa-envelope-o"></i>
                            </span>
                        </a>
                    </li>
                    
                    
                </ul>
            </div>
        </div>
        <div class="row">
            <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                <div class="footer-copyright">
                    © 2015-2019 | <a href="http://wolf-7.github.io/">wolf7.org</a>
                </div>
            </div>
        </div>
    </div>
</footer>

<!-- After footer scripts -->

<!-- jQuery -->
<script src="//code.jquery.com/jquery-2.1.4.min.js"></script>

<!-- Tween Max -->
<script src="//cdnjs.cloudflare.com/ajax/libs/gsap/1.18.5/TweenMax.min.js"></script>

<!-- Gallery -->
<script src="//cdnjs.cloudflare.com/ajax/libs/featherlight/1.3.5/featherlight.min.js" type="text/javascript" charset="utf-8"></script>

<!-- Custom JavaScript -->
<script src="/js/main.js"></script>

<!-- Disqus Comments -->



</body>

</html>